[{"title": "Great Service", "text": "I was so pleased with all of the great service that I received from First Midwest Bank the loan officer Jasmine Vargas with always prompt and on time and everything worked out so well also would like to thank the bank of First Midwest in Blue Island they were fantastic. Every time I went in to have something faxed they were always so courteous and prompt so I had a very good experience. I would definitely recommend to anyone in need of financial assistance", "consumerName": "Bernice", "consumerFrom": "Chicago, IL", "consumerReviewDate": "April 2019", "stars": 5}, {"title": "great experience", "text": "great to work with.  fast & efficient.  had my closing and money within days.", "consumerName": "brenda", "consumerFrom": "Anderson, IN", "consumerReviewDate": "September 2018", "stars": 5}, {"title": "Excellent customer service ", "text": "I got a home equity credit line with First Midwest in order to purchase another home.  Max provided excellent customer service and was very attentive to my need for having everything done in time for closing .  They also had the best rate I could find.  Would definitely recommend them and use them again .", "consumerName": "Beverly", "consumerFrom": "Schaumburg, IL", "consumerReviewDate": "March 2019", "stars": 5}, {"title": "Home equity loan", "text": "The lender guilded us step by step for the loan application, the process went quickly and smoothly. I am totally satisfied with the whole process", "consumerName": "Chuanyi", "consumerFrom": "Bolingbrook, IL", "consumerReviewDate": "August 2018", "stars": 5}, {"title": "Easy process!", "text": "Easy process. very simple. Money came fast. Max made the process easy to do and not alot of time filling out application ", "consumerName": "Chelsey", "consumerFrom": "Loogootee, IN", "consumerReviewDate": "February 2019", "stars": 5}, {"title": "Patrick", "text": "very good experience and done quickly. I would recommend having all of your paperwork ready they will give you a list and just get it done correctly and promptly. It will save you a bunch of time", "consumerName": "Patrick", "consumerFrom": "Shorewood, IL", "consumerReviewDate": "August 2018", "stars": 5}, {"title": "Great experience ", "text": "Everything went really smooth from start to finish. Great experience. ", "consumerName": "Sharon", "consumerFrom": "Summerville, SC", "consumerReviewDate": "February 2019", "stars": 5}, {"title": "Loves it", "text": "My experience was fantastic! These guys ate wonderful! By far the most expedient and convenient loan I ever got from a bank. The customer service is world class!", "consumerName": "Billie", "consumerFrom": "Dalton, GA", "consumerReviewDate": "August 2018", "stars": 5}, {"title": "Great Bank", "text": "Knowledgable of the loan I was applying for.\r\nAmazing follow up. Closed in less than 48 hours.\r\nWish all customer service and banks are like First Midwest Bank", "consumerName": "Yolanda", "consumerFrom": "Hartsdale, NY", "consumerReviewDate": "February 2019", "stars": 5}, {"title": "very good experience!!!", "text": "my experience was probably the best ive ever had when dealing with loans.  The entire process was very easy and fast.  The online application was super simple and easy.  The staff at first midwest is very helpful!", "consumerName": "jeremy", "consumerFrom": "Glenford, OH", "consumerReviewDate": "February 2021", "stars": 5}, {"title": "Excellent Service", "text": "Within 24 hours after I applied for a loan, I received a call from one of the reps who guided me thru the process of what I needed to submit for further approval of the loan.  Within two days, I had my money.", "consumerName": "Judy", "consumerFrom": "Fredonia, KY", "consumerReviewDate": "August 2018", "stars": 5}, {"title": "Excellent Service", "text": "it was great, fast, easy ,simple", "consumerName": "Yolanda", "consumerFrom": "Hartsdale, NY", "consumerReviewDate": "February 2019", "stars": 5}, {"title": "Easy, smooth, fast.  Very good experience.", "text": "Pretty great process.  Very smooth.  Got approval within about 3-4 business days, loan documents quickly, and funding within about 1-week of initial application on LendingTree.\n\r\nFirst Midwest Bank was very responsive.  I was contacted by a loan agent in a personal way to get my application materials fully submitted.  From there, I was handed off to a processing agent to facilitate the terms of the loan, and execution of the loan docs.\n\r\nEverything was done electronically.  No need to go to a branch.  Standard credit check, employment and income verification, and photo ID.\n\r\nI highly recommend.", "consumerName": "Paul", "consumerFrom": "Miami Beach, FL", "consumerReviewDate": "August 2018", "stars": 5}, {"title": "INCOMPETENTS  LIVES AT MIDWEST VANK", "text": "WOW CAN NOT BELIVE ALL OF THE FAKE REVIEWS....  Folks this Company is one that you should stay far AWAY from , their tactics and business practices are deceptive at best and their Staffs incompetence is 2nd to To none.\r\nTrust me when I say take all of your Banking Loan \r\ncommercial \r\n private or business needs Elsewhere \r\nBelin who answers 5he phone is is rude and unprofessional and Patrick Offerman who is your initial contact is a joke at best will not follow up nor lacks the brain power or want to contact his clients . for instance I was told needed a blank check for direct deposit after being approved. I told him dont have checks dont write checks . but I can provide my account and routing number to my checking account . he again demanded I provide a blank check through email.  Belin was so rude and not willing to help me finish understanding which documents were still needed I decided mid way through our phone call \r\nthat if you guys dont want to help me understand what you are requesting  then i will take my 748. credit Score and take my business elsewhere. \r\nExactly what i did . \r\nYOU HAVE BEEN WARNED ", "consumerName": "Michael", "consumerFrom": "Maumelle, AR", "consumerReviewDate": "January 2019", "stars": 1}, {"title": "Fast and Courteous ", "text": "I  applied through Lending Tree and Recieved a quote a monthly payment,  about an hour I received a call from First Midwest Bank and spoke with the loan officer and was approved by the end of business day and received my loan in 5 days.  AWESOME to deal with..", "consumerName": "Kenneth", "consumerFrom": "Indianapolis, IN", "consumerReviewDate": "August 2018", "stars": 5}, {"title": "Consolidation for Deb Evans", "text": "She did an excellent job. Her and her team worked very well together. They are very professional. I was very impressed. I would recommend them to someone else in a heartbeat:) ", "consumerName": "Debra", "consumerFrom": "Sioux City, IA", "consumerReviewDate": "November 2018", "stars": 5}, {"title": "lender review", "text": "First Midwest Bank associates were very friendly and always willing to work with me.  I got my loan pretty quick.  It was fast and easy to apply.", "consumerName": "Susan", "consumerFrom": "Chicopee, MA", "consumerReviewDate": "July 2018", "stars": 5}, {"title": "Consolidation for Deb Evans", "text": "From the beginning to the end, the loan process went quick and without any problems. The staff were very pleasant and easy to work with. They were very informed about their jobs and they all worked together very well. When I had questions they were more than capable to help me. The interest rate I received through them was such a blessing, and I was able to consolidate some of my other bills. It was a pleasure working with you First Midwest!", "consumerName": "Debra", "consumerFrom": "Sioux City, IA", "consumerReviewDate": "November 2018", "stars": 5}, {"title": "Home Equity Line of Credit", "text": "She was ALWAYS available to me if not by phone then via email and she ALWAYS responded in a timely manner and never left me hanging. She was GREAT!!", "consumerName": "Mary", "consumerFrom": "Wheatfield, IN", "consumerReviewDate": "July 2018", "stars": 5}, {"title": "Belen Cordova for Outstanding Customer Service", "text": "First and foremost I want to acknowledge Belen Cordova for her Outstanding Customer Service from my first call. She listened to my concerns and my situations and told me that First Midwest Bank would be happy to secure the loan amount I was requesting and that she was happy to take all my information right then to get things started.  \n\r\nDuring the whole process she emailed me and we played phone tag and kept me informed on everything she was doing to secure my loan.  \n\r\nBelen's cheerful personality (which came across right from the start)  and professionalism was a pleasure and I felt like I was the only one she was working with.  \n\r\nIt was a great experience working with Belen and associates I had the pleasure of speaking with.  \n\r\nI retired after 25 years in the Navy working with Admirals onboard ships and at Headquarters in the South Pacific and I always strived to make sure my staff always presented themselves in the highest level of professionalism and being friendly to all who came to pay a call on our Admirals. Which included Presidents, Heads of State and Foreign Digatorties. So when I see and this same type of person has that special Customer Service Skill that can't be taught, I want to acknowledge her.  \n\r\nBelen I am very happy you were called that day and became my banker. \n\r\nThank you and \"Keep up the Good Work\"  You are truly a great asset at First Midwest Bank.  ", "consumerName": "Thomas", "consumerFrom": "Hanford, CA", "consumerReviewDate": "October 2018", "stars": 5}, {"title": "Home Equity Line of Credit", "text": "Went through Lending Tree to get people to respond to me and First Midwest contacted me and did an excellent job getting me through the process. Cassie Navarrete was GREAT. If you can't get her by phone she was always availably via email and responded to EVERY one of them promptly.  ", "consumerName": "Mary", "consumerFrom": "Wheatfield, IN", "consumerReviewDate": "July 2018", "stars": 5}, {"title": "Refinance is still going on at 3 months!", "text": "Okay, I admit that if it closes great!  But, this has been an ordeal where they constantly ask for the same information and then ask for it again.  Then they say \"almost there.\" Then more information needed.  The portal says \"you're all done, then guess what?  they ask for more!  I have a credit rating of 734, and made 4 mortgage payments in a row after the pandemic forced me to do forbearance for two months.  I ended it early and then paid up three months in advance.  What does First Midwest do?  They asked for another payment to be made and blamed the original mortgage company.  I even told the loan officer that if they were going to turn it down then turn it down so I can go to a better lender!  I will complete my loan hopefully soon but I would NEVER recommend this company!!!!!", "consumerName": "Steve", "consumerFrom": "Midlothian, VA", "consumerReviewDate": "October 2020", "stars": 1}, {"title": "Great Experience", "text": "When I logged onto the Lendingtree website last week, there were several lenders available to assist with my financial needs. I had just finished completing the process when TeAnna Jones, with First Midwest Bank reached out to me. I told her that since she was the first person to reach out to me, and had very favorable rates, I would go with her company to refinance an existing loan. TeAnna was very courteous, knowlegable, and pleasant. She answered all of my questions and took the time to walk me through each step of the process. It was my pleasure to speak with her. In closing, I would certainly do business again with First Midwest Bank.Craig  R", "consumerName": "Craig", "consumerFrom": "Rocky Mount, NC", "consumerReviewDate": "August 2020", "stars": 5}, {"title": "Rates were great, but service and process HORRIBLE", "text": "With over 30 years in the consumer services field myself, I understand the value and need to share not only legitimate complaints, but positive feedback as well. Unfortunately, this is not the latter. I cannot begin to share in depth the nature of my dissatisfaction with this organization and the parties who handled my refinance. It was headed by Chris B, loan originator.We certainly recognize that times have changed with the Covid-19 pandemic and I listened to that as an excuse for weeks, and accepted it generally as to be reasonable and understanding. However, the major basis of my complaint, and reason we will take the time to document and share such a poor experience goes beyond just the time it took (over 2.5 months) to get this done. Let's just say had I received the email I got yesterday within the 72 hour period to cancel the loan, it would have been!The loan officer, Chris B, had the worst Communication, Attention to detail, and professional advocacy that we have encountered. He had an excuse for everything and it's apparent his organizational skills are lacking. The outsourced, apparent overseas, loan processor only corresponded late at night (time zone variance I assume.) The Communication amongst them was missing glaringly, and they constantly just kept muffling the process. We nearly stopped the refinance several times and honestly had it not been for the Covid-19 and our attention focused elsewhere, we WOULD HAVE!We had enormous equity in our home, it should've been a straight forward refinance, and I feel quite often we were asked for unnecessary documentation duplicate times, even after producing. We understand the process and business of mortgage lending. Other lenders solicited us to close with them (even providing 10-20 day closing guarantees), but had already paid for appraisal and rate was 3.125% so we stuck it out.  Our documentation, records, and emails support every bit of the complaints and therefore hopefully real Quality Assurance, Training, and Monitoring will become more of their focus. It's easy when rates and times like this have record breaking applications and hundreds of millions of dollars in profits to be made, but when that dries up, service and professionalism will be the core of those who survive and endure.If their rates are WELL below others and you can deal with unprofessional responses, poor communication and a lengthy process (had excellent credit, all documents, tons of equity, this should've closed in 20 days tops) then use them, if NOT, go elsewhere.", "consumerName": "Bridget", "consumerFrom": "Murfreesboro, TN", "consumerReviewDate": "May 2020", "stars": 1}, {"title": "Good bank", "text": "Excellent experience very helpful", "consumerName": "Richard", "consumerFrom": "Kane, PA", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Great job.", "text": "It was a pleasure to work with this org. to get a loan. They were very professional and polite. They did their job fast. Thanks to all of you.", "consumerName": "willie", "consumerFrom": "Cedarville, AR", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Excellent pain free transaction!", "text": "Very good communication from First Midwest, they explained the process from start to finish! Very happy with the great rates, results and customer service.", "consumerName": "Robert", "consumerFrom": "Pleasant Valley, IA", "consumerReviewDate": "February 2020", "stars": 5}, {"title": "Very easy process ", "text": "Cassie was great. Super easy process. Quick funding. ", "consumerName": "sarah", "consumerFrom": "Andover, MA", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Max was great!", "text": "Max was very patient and answered all of my questions in a timely manner.", "consumerName": "James", "consumerFrom": "Crothersville, IN", "consumerReviewDate": "May 2017", "stars": 5}, {"title": "Great 5 star lender", "text": "Smoothest process I've experienced obtaining a loan. Mj was a huge help from start to finish. A 5 star lender all the way. Look forward to many more years of partnership ", "consumerName": "John", "consumerFrom": "Valparaiso, IN", "consumerReviewDate": "January 2020", "stars": 5}, {"title": "SUPERB", "text": "Very professional with ease of access to support and documentation ! My Loan Officer Margarita Reyes was very informative and helpful throughout my application and closing ! ", "consumerName": "RICHARD", "consumerFrom": "Myrtle Beach, SC", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Give this Bank a chance", "text": "Miss Margarita Reyes was very helpful. Excellent person to person approach on her part. Made me feel very confident about my loan despite all the negative reviews I had read previously.", "consumerName": "maria", "consumerFrom": "Hialeah, FL", "consumerReviewDate": "April 2017", "stars": 5}, {"title": "Outstanding Experience ", "text": "Very impressed with the professionalism and knowledge each representative from First Midwest Bank had to offer. Never a problem to ask about any questions or concerns. A bank that listens to you when you speak to them about your financial needs. First Midwest Bank was very fast getting our loan to us after completing the quick and easy application process. ", "consumerName": "Timothy", "consumerFrom": "Summit, NY", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Quick, convenient process", "text": "The process was fairly easy; closing was convenient and Cassie had great communication. I knew what was happening every step of the way. My only concern is that I closed almost 2 weeks ago and have not received any information regarding payment. I tried to register online but it asked for my last payment info before setting up. So, I can't pay online until I make a payment? That doesn't make sense to me.", "consumerName": "Catherine", "consumerFrom": "Algonquin, IL", "consumerReviewDate": "June 2018", "stars": 5}, {"title": "HELOC Client", "text": "My Loan officer Patrick was professional and prompt in delivering the information I needed to close the deal fast. Thank you, First Midwest Bank!", "consumerName": "Aisha", "consumerFrom": "Chicago, IL", "consumerReviewDate": "November 2019", "stars": 5}, {"title": "Serious waste of time ", "text": "A simple “personal loan” became a game of “now we need”.  Was touted as a quick process. the loan is obviously a consolidation loan - which  would be fine. If you don’t like playing games and jumping through hoops dont bother with this “bank” the interest quoted has gone up and they haven’t done anything yet", "consumerName": "Laura", "consumerFrom": "Frewsburg, NY", "consumerReviewDate": "July 2019", "stars": 1}, {"title": "Great Experience with First Midwest", "text": "From the start all the way through the process to the end, First Midwest, and my agent in particular was fantastic.  The process was quick, the requirements were pretty standard and easily accessible.  We were able to have an open dialogue about what questions the bank had and I was approved and with a  good rate and funds within a few days.  Thank you so much!", "consumerName": "Chad", "consumerFrom": "Miami Beach, FL", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Wanda was wonderful", "text": "Wanda was prompt, professional, and friendly.  I would not hesitate to refer or use her service again.  EXCELLENT in every way!", "consumerName": "edward", "consumerFrom": "Derry, NH", "consumerReviewDate": "March 2017", "stars": 5}, {"title": "Best loan experience", "text": "Fast, honest and reliable. One of the best loan experiences of my life! They were easy to work with and immediately responded to all of my inquiries. ", "consumerName": "Ryan", "consumerFrom": "Eagle, CO", "consumerReviewDate": "September 2019", "stars": 5}, {"title": "Loan application ", "text": "Mr. Ortiz was very professional. He responded immediately to all questions and guided us smoothly through the process. ", "consumerName": "Cathy", "consumerFrom": "Kissee Mills, MO", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Excellent Service", "text": "Everything about being able to obtain this loan and the process surrounding was extremely easy. I'm very comfortable with the interest rate and payment options. I especially want to thank Patrick Offerman for his kindness and professionalism in helping me to obtain my goals. I would recommend First Midwest Bank to anyone looking for help with his or her debt.", "consumerName": "Sharon", "consumerFrom": "Decatur, IL", "consumerReviewDate": "April 2018", "stars": 5}, {"title": "Thank you", "text": "Max was extremely helpful in the process. He answered all my questions and was very responsive. ", "consumerName": "Linda", "consumerFrom": "Dunnellon, FL", "consumerReviewDate": "March 2018", "stars": 4}, {"title": "very quick and painless process", "text": "Attractive rates and fee structure. Quick approval process, great communication, convenient closing. We were very  pleased with our experience and would recommend First Midwest to anyone looking for an equity credit line.", "consumerName": "Thomas", "consumerFrom": "La Grange, IL", "consumerReviewDate": "June 2018", "stars": 5}, {"title": "A credit to your bank.", "text": "TJ was my guide from start to finish in the loan process. She was patient, very kind, and empathetic of my difficulties with on-line skills.  Most of all she reassured me that I would get through all the phases involved.  I owe her a debt of caring.", "consumerName": "Andrew", "consumerFrom": "Aspen, CO", "consumerReviewDate": "July 2019", "stars": 5}, {"title": "Fantastic process and customer service", "text": "I kept delaying applying for a loan simply because I thought it would be a long, drawn out process. Fist Midwest was incredibly efficient, and even after I waited a week after inquiring online, did not bombard me with phone calls or emails. When I did call back, the agent I was dealing with was on the phone, and another agent took all the necessary info and submitted it to the aforementioned age**.It took literally minutes to complete the final process. Jasmine Vargas called me within a day or two with the approval results. The service was fantastic, the fee reasonable, and the rate was superior to any other offer I received.", "consumerName": "jean", "consumerFrom": "Chicago, IL", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Great Experience", "text": "The entire process was amazingly straightforward, clear, fast and accurate. We had excellent service throughout the entire process.", "consumerName": "Joseph", "consumerFrom": "Dundee, IL", "consumerReviewDate": "April 2018", "stars": 5}, {"title": "Very trustworthy and helpful", "text": " She was always quite cordial and professional, but with a friendly tone - which put me at ease.  She was able to assist me with any questions.  She also put value in her team of associates, which translated to me I could trust them also when she was not available.\n\r\nOverall, a very pleasant experience.  I look forward to being a customer.", "consumerName": "Rita", "consumerFrom": "Fruitland Park, FL", "consumerReviewDate": "February 2017", "stars": 5}, {"title": "Superstar Representative", "text": "TeAnn a was a pleasure to work with.  She is very knowledgeable and answered all my questions clearly and informatively. She made this whole experience easy with her step by step explanation of what to expect and how to finalize the loan", "consumerName": "katherine", "consumerFrom": "Bronx, NY", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Customer Service", "text": "I wanted to specifically thank Belen Cordova for her exceptional customer service and professionalism.  Thank you again!", "consumerName": "Juanita", "consumerFrom": "Crystal Lake, IL", "consumerReviewDate": "September 2019", "stars": 5}, {"title": "Great job", "text": "Ms. Cordova  was very helpful and help me with all my questions. Getting my loan was very easy . I would like to thank all the other people at First Midwest what their help too. I hope to do business with First Midwest again . Once again thank you for your help getting my loan Toby", "consumerName": "toby", "consumerFrom": "Winchester, VA", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Review of loan officer", "text": "Patrick was extremely responsive and timely in getting back to me.  He made the process easy!", "consumerName": "mary", "consumerFrom": "Chicago, IL", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Smooth process", "text": "Kristina was very responsive, and answered my questions clearly. She worked with me towards the goals I was trying to achieve. She didn't pressure me for lending was not interested in obtaining. She was friendly, straightforward, and informative.  The whole process moved quickly and smoothly. ", "consumerName": "Justine", "consumerFrom": "Bartlett, IL", "consumerReviewDate": "June 2018", "stars": 5}, {"title": "Cfsi", "text": "Great doing business wit**.very professional and hel*****.thanks Gonzales,carmen..", "consumerName": "Ahmed", "consumerFrom": "Coal Township, PA", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Best", "text": "Best decision i could have made. Kind agent very precise and friendly help. She gave us plenty of options that worked best for our family..", "consumerName": "Oneal", "consumerFrom": "Decatur, IL", "consumerReviewDate": "August 2019", "stars": 5}, {"title": "personal loan", "text": "The process was very smooth.  The person we worked with was very fast in responding to emails and answering question.  The closing and disbursement of funds was quick and smooth.  I would recommend to anyone needing a loan.  ", "consumerName": "James", "consumerFrom": "Pisgah Forest, NC", "consumerReviewDate": "March 2018", "stars": 4}, {"title": "Home Equity Line of Credit", "text": "All of the individuals I had contact with during this process were extremely knowledgeable professionals.  Additionally they were helpful in answering questions and seemed sincerely interested in helping me with this process.\r\nIf I needed to do business like this in the future I would go back to them again.", "consumerName": "mary", "consumerFrom": "Chicago, IL", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Clear and responsive communication", "text": "First Midwest is professional, responsive, and clearly provides information, including quotes, based on your needs.  They do not pressure you to obtain lending you are uninterested in. You tell them what you want, in layman's terms, and they do their best to provide it. They treat you with respect. They respond in a timely manner and do not bombard you with excessive phone calls or other communication.  Can't say anything bad about First Midwest Bank.", "consumerName": "Justine", "consumerFrom": "Bartlett, IL", "consumerReviewDate": "June 2018", "stars": 5}, {"title": "Highly recommend", "text": "Very good loan officer. She is very informative and let’s you know how the process is moving along. Definitely recommend working with her. ", "consumerName": "Megan", "consumerFrom": "Marysville, PA", "consumerReviewDate": "February 2018", "stars": 5}, {"title": "Very Satisfied", "text": "Service was great!", "consumerName": "Andrew", "consumerFrom": "Norfolk, NE", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Highly recommended!!!", "text": "Super fast! Super easy! Great customer service! ", "consumerName": "Kristina", "consumerFrom": "Woodridge, IL", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Easy, Fast and Friendly", "text": "The process was very simple and easy. Their rates and fees were the best that we found. First Midwest was extremely helpful with all of our questions and flexible to accommodate our schedule. In addition to all of that, they are super friendly!", "consumerName": "Glen", "consumerFrom": "Aurora, IL", "consumerReviewDate": "June 2018", "stars": 5}, {"title": "Cassie Navarette rules!", "text": "Thank you Cassie, you are special in every way.  You helped me in more ways than your know.  I would come back time and time again if needed.  You're service is flawless, your response is more than on spot and you are very curteous and nice.  Thank you so much for helping me!", "consumerName": "Barbara", "consumerFrom": "Louisville, KY", "consumerReviewDate": "February 2018", "stars": 5}, {"title": "Fantastic and Seemless Customer Service", "text": "Kristina was top notch and hands on throughout the process.  I couldn't have asked for a better person to work on my behalf.", "consumerName": "Lisa", "consumerFrom": "North Adams, MA", "consumerReviewDate": "February 2017", "stars": 5}, {"title": "Really easy great Customer Service", "text": "They were super easy to work with, the paperwork was very simple, and the requests kept to a minimum ", "consumerName": "Donald", "consumerFrom": "Greer, SC", "consumerReviewDate": "June 2019", "stars": 5}, {"title": "Easy Loan Process", "text": "Easy, Fast response, great customer service ", "consumerName": "Darlene", "consumerFrom": "Gastonia, NC", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Exactly what I was looking for!", "text": "Communication was great! My agent was VERY helpful. The process was speedy. I really enjoyed working with First Midwest Bank and hope to again in the future!", "consumerName": "Jamie", "consumerFrom": "Hanover, IL", "consumerReviewDate": "April 2018", "stars": 5}, {"title": "Gold Standard for Bank Services ", "text": "Great experience with First Midwest Bank. Outstanding customer service and rates. They have become my first choice for all my financial loan services.  You can't go wrong with this bank. They are the gold standard for all other banks to try to reach.", "consumerName": "Joseph", "consumerFrom": "Bloomingdale, IL", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Q&E", "text": "Quick, easy, and professional staff to talk with.", "consumerName": "Eldon", "consumerFrom": "West Jefferson, NC", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "HELOC closing", "text": "First Midwest Bank was very easy to work with.  Most of our communication was done on-line and via email, although we did speak with them on the phone and closed in person.", "consumerName": "Troy", "consumerFrom": "Barrington, IL", "consumerReviewDate": "May 2018", "stars": 5}, {"title": "Fast and easy ", "text": "It’s was quick and great int*****.they paid off all my credit card and deposit the remaining to my account ", "consumerName": "Farah", "consumerFrom": "Westbury, NY", "consumerReviewDate": "January 2018", "stars": 5}, {"title": "Great job!", "text": "I have worked with several loan officers o*.er my 60 years and I have to rate Cyndi among the very best. She was completely straightforward and yet took the time to display a friendly, customer oriented attitude. My credit being excellent I had five responses and five reasonable offers. Some sounded like boiler room operations but the First Midwest Bank folks were completely professional. Cyndi responded to all my questions and concerns promptly and completely. She didn't harm my credit rating with repeated inquiries like two national firms did with duplicate \"hard\" inquiries. The entire process was handled smoothly and speedily.  ", "consumerName": "Gregory", "consumerFrom": "Saint Olaf, IA", "consumerReviewDate": "February 2017", "stars": 5}, {"title": "Great experience, literally one of the easiest loans I’ve ever gotten!", "text": "Since my loan was being done long distance and I found the company online, I was skeptical 🤨 but was I extremely  impressed  with the great experience!! Shawn and his team kept me in the loop at all times!  I had direct access to Shawn from the very beginning.  My loan could have closed two weeks ahead of schedule had I wanted it to!!  Very glad I chose First Midwest Bank. ", "consumerName": "Tonja", "consumerFrom": "Rocklin, CA", "consumerReviewDate": "June 2019", "stars": 5}, {"title": "Fast service", "text": "The process was comfortable and fast", "consumerName": "Ansermo", "consumerFrom": "Pensacola, FL", "consumerReviewDate": "March 2018", "stars": 4}, {"title": "Quick and easy ", "text": "The process was quick and painless. Whole thing took less a day. The rep that helped me was very informative and walked me through everything. I would highly recommend working with First Midwest Bank. ", "consumerName": "james", "consumerFrom": "Hauppauge, NY", "consumerReviewDate": "April 2018", "stars": 5}, {"title": "Great service & great rates", "text": "Belen did an excellent job working on my personal loan. She was responsive, quick to get back to me and made the entire process very easy.  I can not say enough about what a great experience I had with this transaction and I will no doubt be a customer for many years to come.  First Midwest Bank will now be my first choice for all my financial needs.", "consumerName": "Joseph", "consumerFrom": "Bloomingdale, IL", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Easy and Trustworthy", "text": "I was so pleased with the speed and efficiency of the loan process. ", "consumerName": "Cheryl", "consumerFrom": "Decatur, IL", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "HELOC ", "text": "Amanda \"Mandy\" Kurczaba was great to work with throughout the HELOC process. I was able to scan documents on my phone and email them to her, which was very convenient. Mandy would respond to my many emails within 30-60 minutes and was always very professional. If you want to choose a great loan officer, Mandy is a responsive and knowledgeable person.", "consumerName": "Trent", "consumerFrom": "Fort Wayne, IN", "consumerReviewDate": "May 2018", "stars": 5}, {"title": "personal loan", "text": "Our loan process was quick and easy. Both Belen and customer service were very quick to respond to any questions or concerns.", "consumerName": "brad", "consumerFrom": "Lutz, FL", "consumerReviewDate": "January 2018", "stars": 5}, {"title": "Quick, and eas***.with a good rate!", "text": "After filling out a form online, Kristina contacted me to inquire about my need for a loan.  From start to finish she was very professional, and responsive to my messages, or calls.  The entire process took about a week before I received the money, directly into my checking account.  The timing was perfect because I needed it the very next day to make the deal.  It was very easy, and the rate I got was better than my credit union was offering, which surprised me as I have an excellent credit score.  I will definitely contact Christina at First Midwest Bank if I need another loan.  Thanks for making the process a piece of cake!", "consumerName": "Mark", "consumerFrom": "Akron, OH", "consumerReviewDate": "February 2017", "stars": 5}, {"title": "Overall it was a good process with good rates", "text": "The entire process was pretty easy and the bank was very responsive to any and all questions. Also had better rates than US Bank which is who our mortgage was originally with.", "consumerName": "Ray", "consumerFrom": "Libertyville, IL", "consumerReviewDate": "May 2019", "stars": 5}, {"title": "great experience!!", "text": "kristina was a great help,fast and really knew what she was doing. she went above and beyond for me at a crucial time.  thanks again!!!", "consumerName": "Matthew", "consumerFrom": "Joliet, IL", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "TeAnna is awesome!", "text": "TeAnna was extremely helpful. She was very informative, walked me through every detail, and took the time to answer every question I had. TeAnna set and exceeded my expectation. I would highly recommend working with TeAnna. ", "consumerName": "james", "consumerFrom": "Hauppauge, NY", "consumerReviewDate": "April 2018", "stars": 5}, {"title": "First Midwest", "text": "Everyone was very nice and answered all my questions in a clear way I could understand.  Very easy to close, and closed on our loan quickly.  Would definitely recommend.", "consumerName": "Diane", "consumerFrom": "Angier, NC", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Great Experience!", "text": "Cassie was great! Easy process as she explained all steps clearly to me and what was needed before closing. Low closing costs, too! I highly recommend for any loan needs and great customer service!", "consumerName": "Jodye", "consumerFrom": "Fort Collins, CO", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Loan made easy", "text": "Doing everything online was new to me for a loan,but,everything went together great, e-mails, document scans,phone calls,it was a lot easier than multiple trips to the bank and then days of not knowing what was going on Great job by Patrick and all those who helped along the way, THANK-YOU", "consumerName": "Warren", "consumerFrom": "Midlothian, IL", "consumerReviewDate": "April 2018", "stars": 5}, {"title": "Top notch customer service", "text": "Extremely friendly and professional.  He made my entire lending experience a breeze. ", "consumerName": "Mark", "consumerFrom": "Glendale Heights, IL", "consumerReviewDate": "January 2018", "stars": 5}, {"title": "Kristina ", "text": "Kristina very knowlegable and professional. Help me threw loan process and was on top of everything. Thank you Kristina \n", "consumerName": "Brunilda", "consumerFrom": "Deltona, FL", "consumerReviewDate": "January 2017", "stars": 5}, {"title": "Easy peazy", "text": "My banker was easy to work with.  The entire process was easy and painless.  We are doing a kitchen remodel and doing a HELOC made the most sense.Thank you!", "consumerName": "Christina", "consumerFrom": "Wilmette, IL", "consumerReviewDate": "May 2019", "stars": 5}, {"title": "great experience!!", "text": "i delt the most with kristina geary. she was a great help! i was slow getting documents and paperwork together and she was very patient and gave me tips how to move it along. she was very knowledgeable and great at her job!!!  all others that i talked to were also polite and professional. very satisfied with the whole experience.", "consumerName": "Matthew", "consumerFrom": "Joliet, IL", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "outstanding customer service", "text": "I worked with Christine Ruiz for my personal loan.  She answered all my questions, was professional  and pleasant to work with.  The offer and rates are competitive. The whole process was fast, smooth and convenient.  Will continue to do business with this company in the future.", "consumerName": "crystal", "consumerFrom": "Cape Coral, FL", "consumerReviewDate": "April 2018", "stars": 5}, {"title": "great service", "text": "Great service by TeAnna. Professional and fast", "consumerName": "Ray", "consumerFrom": "Dayton, OH", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Highly recommend!!!", "text": "Service is fast and accurate. Very responsive to my need with no rejections. ", "consumerName": "Muriel", "consumerFrom": "Lynn, MA", "consumerReviewDate": "April 2018", "stars": 5}, {"title": "Blown away!", "text": "Sonia was an absolute rock star.  She helped me consolidate nearly $25,000 in credit card debt - saving me thousands in interest while paying off my debt so much more quickly.  She was attentive, quick to respond, and had me go from application to funds in my account within 2 business days.  First Midwest Bank blew me away with the service I received and earned my trust and future business in the process.", "consumerName": "Jack", "consumerFrom": "Darien, IL", "consumerReviewDate": "December 2017", "stars": 5}, {"title": "Senior Citizens approved ", "text": "Karen and the rest of your staff was very patient with me .. Process not easy for a 66 yr old and a iPad .. From beginning to my first payment due .. There were no problems ... Funds were in my account in less than a week ..my local bank wait was 3 weeks and still an online process ... Again Karen was great ", "consumerName": "Charles", "consumerFrom": "Canonsburg, PA", "consumerReviewDate": "August 2016", "stars": 5}, {"title": "Carmen Gonzalez & First Midwest: A++++", "text": "Submitted request on lending tree.  Carmen Gonzalez at First Midwest was the first to respond.  It was literally within about 2 minutes of my submission. I was not ready to pull the trigger on the loan quite yet but she listened carefully and responded accordingly.  I got all of the pertinent information to make a decision and listened to a few other offers.  It was a pretty easy decision to go with First Midwest.  After I made the official request I needed to collect and submit all of my financial documents which I attempted to do from my phone as I was on the road. i had massive email problems yet Carmen was very patient and understanding.  We muscled our way through it and I got the loan in time to make my purchase.  Excellent work by carmen and her entire organization.\n\r\nRB", "consumerName": "Robert", "consumerFrom": "Webster, NY", "consumerReviewDate": "April 2018", "stars": 5}, {"title": "Thanks Kristina", "text": "Kristina at First Midwest Bank was the first one to reach out to me after applying for a loan at lending tree.  At first, I was somewhat skeptical about going through lending tree.  I had serious doubts if any bank would be able to assist me.  Kristina emailed and called me to let me know that First Midwest Bank could help me out.  She was courteous and helpful and I'd highly recommend anybody seeking a loan, let Kristina and her fellow staff at First Midwest Bank  help you out.", "consumerName": "Brian", "consumerFrom": "Richmond, KY", "consumerReviewDate": "July 2017", "stars": 5}, {"title": "Exceeds all Expectations!", "text": "Celestine exceeds all expectations!  Not only is she patient but makes it a point to call and follow up on any questions that arise.  She held my hand and guided me through my first \"on-line\" lending experience.  From the first contact it was clear Ms. Kinnie enjoys helping others.  She is an answered prayer in the on-line financial jungle!  Thank you again,\n\r\ncj", "consumerName": "Connie", "consumerFrom": "Freeport, FL", "consumerReviewDate": "August 2016", "stars": 5}, {"title": "Great experience ", "text": "They were very quick, efficient & easy to deal with. ", "consumerName": "Jennifer", "consumerFrom": "Syracuse, IN", "consumerReviewDate": "April 2018", "stars": 5}, {"title": "Good Service and the Best Interest Rate", "text": "The process was fast and easy.  After extensive shopping I received a home equity loan at a rate that beat all the competition.  I am glad I used First Midwest Bank.", "consumerName": "Jason", "consumerFrom": "Arlington Heights, IL", "consumerReviewDate": "May 2019", "stars": 5}, {"title": "Quick process ", "text": "Great work!", "consumerName": "Richard", "consumerFrom": "Union, MO", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Thanks Max", "text": "Mr. Ortiz provided excellent service during my loan application process.  I'd highly recommend anybody needing a loan, let Max help you out.  ", "consumerName": "Brian", "consumerFrom": "Richmond, KY", "consumerReviewDate": "July 2017", "stars": 5}, {"title": "N/A", "text": "Due to my very busy and challenging schedule(3rd shift),  communication on my end was quite lacking. \r\nThrough their tenacity the bank reps made multiple attempts by multiple people to contact me in multiple forms.\r\nI'd have to say I was pleased with their flexibility and accommodation.  \n", "consumerName": "gary-lor", "consumerFrom": "Beverly Hills, CA", "consumerReviewDate": "April 2018", "stars": 5}, {"title": "Great Experience", "text": "I had a great experience. Wonderful communication, great rates. I will definitely call them first for all my needs.", "consumerName": "Heidi", "consumerFrom": "Chicago, IL", "consumerReviewDate": "May 2019", "stars": 5}, {"title": "Professional", "text": "Very professional", "consumerName": "Phylis", "consumerFrom": "Ocala, FL", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "They Make Life Easy", "text": "Through Lending Tree I found MJ at First Midwest.  He patiently worked with me around my work schedule, had the loan in 3 days!  The payoff to the credit cards only took another 2 days.  Very quick and efficient service!", "consumerName": "Elaine", "consumerFrom": "Marengo, IL", "consumerReviewDate": "April 2019", "stars": 5}, {"title": "Working with Belen Morales", "text": "She was very professional and prompt. She did everything in a timely manor and everything went as advertised. Thank you Belen for all your help.", "consumerName": "Alan", "consumerFrom": "Clearwater, FL", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Great Team", "text": "It was a great experience working with the First Midwest Bank team. Patrick is very knowledgeable and understand his clients very well", "consumerName": "Jinny", "consumerFrom": "Buffalo Grove, IL", "consumerReviewDate": "April 2019", "stars": 5}, {"title": "Great Experience", "text": "Great experience all around. Speedy responses via email and took phone calls if I had any questions. If I had to do this all over again I'd pick Cassie to handle it. Thank you!", "consumerName": "Arnold", "consumerFrom": "Johnstown, PA", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Loan Officer Maximilian Ortiz ", "text": "Maximilian Ortiz was an excellent loan officer to work with. He handled my loan request very professionally and very efficiently.", "consumerName": "KEVIN", "consumerFrom": "Winter Park, FL", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "laid back and easy to work with", "text": "Great customer service.  Not overly pushy with getting loan setup.  \r\nVery helpful and low key lender. Love that fact that there are local branches or I can work remotely/electronically.", "consumerName": "Jeremy", "consumerFrom": "Chicago, IL", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "awesome", "text": "I have had great experience with Mandy and She answered all my questions with rapid response. Great customer service and helped me through out the Loan process with speed and accuracy. thank U again Mandy!!", "consumerName": "Patrick", "consumerFrom": "Concordia, MO", "consumerReviewDate": "March 2016", "stars": 5}]