[{"title": "It was good expereince.", "text": "Nate and the Grander Home Loans team always made the process painless. They always have given quick responses and updates with easily understand.", "consumerName": "MyungChul", "consumerFrom": "Englewood, CO", "consumerReviewDate": "March 2021", "stars": 5}, {"title": "Great refinance experience ", "text": "I am so happy a friend recommended Nate and Grander Home Loans to me. The whole experience was very easy and I am very satisfied with the treatment I received from start to finish.  I highly recommend!!", "consumerName": "Kim", "consumerFrom": "Yucaipa, CA", "consumerReviewDate": "March 2021", "stars": 5}, {"title": "Excellent Refinance with Grander", "text": "This was my first refinance so I wasn't sure what to expect other than a big hassle.  Much to my surprise the overall experience was easier than I ever expected.  I had a fantastic experience working through my home refinance with Grander Loans.  Nate was super helpful and promptly answered any questions I had as we navigated the process.  There were no surprises and everything went off with out a hitch.  I highly recommend anyone considering a refinance work with Grander.  ", "consumerName": "Brad", "consumerFrom": "San Diego, CA", "consumerReviewDate": "March 2021", "stars": 5}, {"title": "Simply the BEST!!!!", "text": "Nate and the Grander Home Loans team made the process painless. The BEST Communication and customer service I’ve ever experienced with a loan company. Not to mention, the best rate of the companies I contacted. And I didn’t have to jump through hoops to get it. Trustworthy and dependableMahalo Nate, No Ka Oi!", "consumerName": "Rena", "consumerFrom": "Mililani, HI", "consumerReviewDate": "March 2021", "stars": 5}, {"title": "Excellent experience!", "text": "We were referred to Nate & the Grander team by a close friend and they totally saved us.  We knew it was a great time to be refinancing our mortgage but couldn't figure out the best way to go about it.  We started with some online lending aggregators to compare rates... but it was hard to get an apples-to-apples comparison when factoring in the rates, points and various loan costs.  There is a lot of trickery going on out there, and here's a tip... if a lender approaches you instead of the other way around... run away!  I was also apprehensive about working with online lenders as there are so many mixed reviews and nightmare stories.  There had to be a better way.  Nate took the time to explain how he does business, and I immediately felt very comfortable and confident that this is the way to go!  This small company does not rely on cutting corners to be able to sell hundreds of loans to make a profit off of bulk.  As a broker, they have the advantage of getting the wholesale (not retail) rates, and can then charge a small fee, so you end up with a much better deal than you could get on your own, with a ton of added value.  Do you want someone who communicates every step of the way, tells you everything that will happen, responds personally to all emails/calls, takes the time to answer any questions, and closes super fast?  Stop reading... call Nate, you're welcome!", "consumerName": "Scott", "consumerFrom": "San Diego, CA", "consumerReviewDate": "March 2021", "stars": 5}, {"title": "Great work!", "text": "Great service and very responsive! Nate and team followed through making the refinance process as seamless as possible. ", "consumerName": "Michael", "consumerFrom": "Colorado Springs, CO", "consumerReviewDate": "March 2021", "stars": 5}, {"title": "Nate is the best loan broker!", "text": "This is my second time doing a refi with Nate.  He is by far the best loan broker that I've worked with for single family homes.  He is able to get the deal done when others weren't able to.  Mine wasn't the easiest one to get done, but he found ways to make it work.  He's responsive, accountable, and gets things done!", "consumerName": "Ki", "consumerFrom": "Cypress, CA", "consumerReviewDate": "March 2021", "stars": 5}, {"title": "Great experience, as always!", "text": "Nate and his team at Grander Home Loans never disappoint. This is our 4th time using them and we have recommended them to numerous friends and family and will continue to do so. Nate is always true to his word, great at staying in contact, keeping you in the loop, and always makes sure you understand what is happening and what to expect next. Going with Nate and Grander Home Loans you will get great rates as well as quality care. ", "consumerName": "Brooke", "consumerFrom": "Santee, CA", "consumerReviewDate": "March 2021", "stars": 5}, {"title": "World Class Experience Thanks to Nate Wells", "text": "Nate was my loan agent at Grander in refinancing my home.  After being strung out for more than 2 months before turned down by Rocket, Nate assured me that he could and would get me a  loan.  True to his word, everything went exactly as promised.  Nate was an excellent communicator, keeping me fully informed every step of the way.  As an added bonus, the final interest rate he arranged for me was more than a half percent BELOW what Rocket had offered.  DOUBLE WIN!  Thanks Nate, for doing exactly what you said you would do.  William Terry Hunefeld, San Diego, California", "consumerName": "William", "consumerFrom": "Borrego Springs, CA", "consumerReviewDate": "February 2021", "stars": 5}, {"title": "Another Seamless Refinance", "text": "This is the second time I have used Nate Wells and Grander Home Loans for my VA Home Refinance and have been impressed both times with the level of communications, professionalism and completeness of the process. I referred my daughter and son-in-law to him as well.  Highly Recommend.", "consumerName": "Greg", "consumerFrom": "Florissant, CO", "consumerReviewDate": "February 2021", "stars": 5}, {"title": "Reccomended!", "text": "We have refinanced with Nate at Grander Home Loans 3 times now - he is excellent. Nate is super responsive and professional, and he makes it all very easy. He stays in touch throughout the process, and always gets us a great rate. You can also trust what he says - no hidden costs or surprises at closing. I totally recommend him.", "consumerName": "Alison", "consumerFrom": "Gasquet, CA", "consumerReviewDate": "February 2021", "stars": 5}, {"title": "Repeat Great Experience ", "text": "This was the second time my wife and I refinanced our home mortgage with Grander Home Loans.  We had a such a great experience the first time around that we were very confident Grander was the right choice again. I'm a thorough person, so I did check a couple other companies, but Nate was able to get the lowest rate again (as he did the first time), along with the lowest fees.  Nate was very responsive and thorough when it came to answering questions.  He even gave a weekly check in, unsolicited. We highly recommend Grander Home Loans, and plan to use them again in the future, if needed.", "consumerName": "Joseph", "consumerFrom": "National City, CA", "consumerReviewDate": "February 2021", "stars": 5}, {"title": "We got a great rate and the process was easy and straightforward!", "text": "We just completed our second home refinance with Nate at Grander Home Loans and both times the process was smooth, fast and easy!  Nate took the time to understand our mortgage needs, was very organized, kept us updated along every step of the way, and helped us get the best rate!  During the first time we refinanced, we knew very little about the process and Nate did a great job educating us and providing us with lots of options. I’ve already recommended Nate to multiple friends and family members and we will definitely work with Grander Home Loans for our mortgage needs in the future.", "consumerName": "Alana", "consumerFrom": "Redondo Beach, CA", "consumerReviewDate": "February 2021", "stars": 5}, {"title": "You really can't go wrong with this company", "text": "I have lost count of the number of painless refinances I've done with Nate Wells of Grander Home Loans over the years.  This latest was started during the Christmas holidays and yet was still executed flawlessly.  Nate Wells kept me up-to-date during all phases of the loan process.  He was constantly vigilant against anything that could stall or negatively affect us.  He always responds to his emails almost immediately.  I have never had to argue for the loan that I was initially promised as I have had to with other companies in the past.  I've always received the terms I was quoted with no surprises.  You really can't go wrong with Nate Wells.  ", "consumerName": "Elizabeth", "consumerFrom": "Roseburg, OR", "consumerReviewDate": "February 2021", "stars": 5}, {"title": "Home Refinance", "text": "I had the opportunity to work with Nate and Grander Home Loans as a referral from my in-laws.  We were lucky to get introduced.  We were looking to refinance both our current mortgage along with our investment property.  After running the numbers he was able to refinance our investment property but informed us we would likely find a better rate for our current property else where.  The integrity he showed will certainly lead us to refer anyone looking to refinance to him.  Nate was also very timely and knowledgeable about everything from rates, to docs needed to the best options that would fit our situation. I'd recommend Nate and Grander to all of my friends and family.Mark Hastings", "consumerName": "Mark", "consumerFrom": "Littleton, CO", "consumerReviewDate": "February 2021", "stars": 5}, {"title": "Grander Home Loans, Inc is a no brainer!", "text": "Grander Home Loans, Inc is by far the best way to get your home loan needs handled.  They are crazy responsive, and the cost of getting a loan is a fraction of any other outfit.  Over the last 10 years I have refinanced two loans and taken a home loan with Grander.  Each time I shopped around and Grander has been less expensive and more responsive by a landslide.  I recommend them highly! ", "consumerName": "Mike", "consumerFrom": "Bend, OR", "consumerReviewDate": "February 2021", "stars": 5}, {"title": "Another POSITIVE Experiece!", "text": "We just saved about $350 off our monthly mortgage! This is our FOURTH refi Nate helped us obtain!  All by email and telephone. He responds to any issues and questions very quickly.  We’ve worked with Nate so many times, he’s practically family.  Mahalo! Maraming Salamat-PO! Thank you, Mr. Nate Wells!", "consumerName": "Albert", "consumerFrom": "Waipahu, HI", "consumerReviewDate": "February 2021", "stars": 5}, {"title": "Consistent, excellent service", "text": "I’ve now used Grander Home Loans two times and their service has been great and consistent both times. They are very thorough and professional. They were very good at anticipating documentation issues to keep the loan process moving along. ", "consumerName": "Jeff", "consumerFrom": "Granite Bay, CA", "consumerReviewDate": "January 2021", "stars": 5}, {"title": "Great experience!", "text": "2nd time I used Nate to refinance my mortgage. Great service, great rates, and smooth transaction. Very good experience!", "consumerName": "Jason", "consumerFrom": "Parker, CO", "consumerReviewDate": "January 2021", "stars": 5}, {"title": "Great experience ", "text": "We had our loan refinanced twice and both with Nate. He is very professional and responds to all of my questions in details and with a sense of urgency. I highly recommend him and in fact I already recommended  his services to my wife’s co-worker. I also heard that she is also happy and will also recommend Nate to her family and friends.Thank you Nate and stay safe", "consumerName": "RJ", "consumerFrom": "Glendale, CA", "consumerReviewDate": "January 2021", "stars": 5}, {"title": "Always a great experience", "text": "Nate Wells with Grander Homes Loans has been our go to person for our last three re-finances. He always offers us different financing options and was able to secure us a fantastic rate. We never had to ask for an update because his communication with us has always been excellent.  Nate is honest and thorough. There’s a reason why he has so many return clients. ", "consumerName": "Gina", "consumerFrom": "Carlsbad, CA", "consumerReviewDate": "January 2021", "stars": 5}, {"title": "Numbers Matching!", "text": "I've worked with Nate and Grander Home Loans three times now.  The first time I was in a bind and Nate worked with me to consolidate debt.  The last two were to get lower interest rates.  In all cases Nate is upfront, honest and all the numbers given to me over the phone were on the paperwork.  There were no last minute surprises and I'm very happy to have found someone that does what he says and works hard to get the job done correctly.  Thank you Nate!", "consumerName": "Mike", "consumerFrom": "Parker, CO", "consumerReviewDate": "January 2021", "stars": 5}, {"title": "Great Experience ", "text": "Nate was a pleasure to work with and was extremely helpful. Will always look his and Grander's way! Would recommend ", "consumerName": "Brad", "consumerFrom": "Aurora, CO", "consumerReviewDate": "January 2021", "stars": 5}, {"title": "Thorough and easy to work with.", "text": "We worked with Nate at the end of 2020 to refinance our home.  He was great! Very responsive and took the time to fully explain our options and answer all my questions so I could weigh the pros/cons of each option to figure out what was best for us.  I also found the loans he presented us with to be the most competitive - as I did shop around a bit.  He kept us updated throughout the process and closing was really easy with a notary that came to us.  Great experience all around.  We got a great rate so I don't expect we'll be needing to refinance again, but if we ever do I'll definitely reach out to Nate again.", "consumerName": "Kassie", "consumerFrom": "Damascus, OR", "consumerReviewDate": "January 2021", "stars": 5}, {"title": "Good experience ", "text": "We worked with Nate Wells and had a great experience. Easy to work with and good communication. Would definitely refinance through him again. ", "consumerName": "Deirdre", "consumerFrom": "North Bend, OR", "consumerReviewDate": "January 2021", "stars": 5}, {"title": "It was a good experience!", "text": "Just wrapped up another refinancing loan with grander home loans, Nate Wells is a true professional, excellent communication, very informative, always available, answered all my questions /concerns in a very timely manner. Nate took the stress out of what can be a very stressful process, I personally will be using them again!! Highly recommended. Kim", "consumerName": "Kim", "consumerFrom": "Sisters, OR", "consumerReviewDate": "January 2021", "stars": 5}, {"title": "This was stress free and easy.  Great service", "text": "This is the second time we’ve relied on Nate with Grander to help us with the mortgage process.  Again, he made our mortgage easy and seamless.  Both times we’ve worked with Nate he made sure I was able to make the most of my veteran benefits. This was so easy and saves us money now, and across the life of the loan.  Absolutely zero stress.  Thank you so much Nate", "consumerName": "Ken", "consumerFrom": "Portland, OR", "consumerReviewDate": "January 2021", "stars": 5}, {"title": "It was a good experience.", "text": "The entire process was pretty easy and I was happy to work with them.  Specifically Nate Wells.  He was punctual, honest, and helpful.  I would recommend him to any of my family members and family.  ", "consumerName": "Francisco", "consumerFrom": "Kailua Kona, HI", "consumerReviewDate": "January 2021", "stars": 5}, {"title": "Grander Home Loans is a better company because of Nate Wells ", "text": "This is the second time that I have used Grander Home Loans because I greatly appreciate Nate's prompt service and congenial service. He is always willing to work through any problems that I am experiencing with the loan in a friendly and informative way. He consistently answers my email and phone calls in a timely way with answers to all my questions. The biggest reason I have gone back to Nate to help me refinance my house is because I trust that he is going to give me the best deal that he can and that he will make sure his company does for me what it promised it would do. When the numbers did not seem to add up at different points during the refinance process he was able to clearly explain why and to give me the space to decide if I wanted to move forward on several different occasions. I did not feel pressured to make the deal and the numbers came back very close to what he quoted even though there were some problems with how my last mortgage company handled my escrow account. I recommend Nate to my friends and family and I would like to hire him again the next time I look for a home loan. ", "consumerName": "Benjamin", "consumerFrom": "Salem, OR", "consumerReviewDate": "January 2021", "stars": 5}, {"title": "Grander Home Loans did such an outstanding job, I've used their services twice now", "text": "I've worked with Nate Wells at Grander Home Loans twice now. He did such an outstanding job helping refinance my condo, that I used his services a 2nd time when rates went even lower.  He is always professional, accurate, and ready to answer any questions I have. I recommended him to my friends and family and would happily work with him again.", "consumerName": "Gary", "consumerFrom": "San Diego, CA", "consumerReviewDate": "December 2020", "stars": 5}, {"title": "Excellent costumer service ", "text": "The service that Matt provides is outstanding, he is honest, communicates right away and get you answers with in minutes. This being said makes me want to work with him again without a doubt.", "consumerName": "Dax", "consumerFrom": "San Lorenzo, CA", "consumerReviewDate": "June 2017", "stars": 5}, {"title": "Excellent Experience with Matt Gibbons ", "text": "I had an excellent experience with Grander Home Loans, Inc. Matt Gibbons was the best loan officer I have ever worked with. He was very professional, precise and gave me the best deal. I highly recommend him. He is really smart loan officer.", "consumerName": "Ben", "consumerFrom": "Garden Grove, CA", "consumerReviewDate": "July 2017", "stars": 5}, {"title": "Excellent Experience with Matt Gibbons", "text": "I had an excellent experience with Grander Home Loans, Inc. Matt Gibbons was the best loan officer I have ever worked with. He was very professional, precise and gave me the best deal. I highly recommend him. ", "consumerName": "Ben", "consumerFrom": "Garden Grove, CA", "consumerReviewDate": "July 2017", "stars": 5}, {"title": "Best Refi experience ever!!!", "text": "Nate did an excellent job explaining all the documents leading up to closing.  He answered the phone nearly 100% of the times I called and returned calls promptly when he couldn't answer.  He went out of his way to make sure I got the best deal and did everything he could to save me money throughout the process.  Having financed 3 homes and refinanced 2 loans I can say with certainty that Grander Home Loans was the easiest I have ever worked with and by far the most reasonably priced!  HIRING GRANDER HOME LOANS IS A NO BRAINER!!!!!", "consumerName": "Mike", "consumerFrom": "Bend, OR", "consumerReviewDate": "July 2017", "stars": 5}, {"title": "Nate is great!!", "text": "Nate Wells rocks! He helped me with two refinances over past two years and each time he provided exemplary customer service and always made me feel completely satisfied and at ease with everything. Great and answering questions and providing information. Honest, reliable, knows everything, I wish I had another property to refinance so that I could deal with Nate again!", "consumerName": "Jim", "consumerFrom": "Happy Valley, OR", "consumerReviewDate": "July 2017", "stars": 5}, {"title": "Would recommend too anyone", "text": "Jevon and his team were great. They helped us refinance our home. Very responsive and very low cost. Would use again and recommend to anyone.", "consumerName": "Andrew", "consumerFrom": "San Clemente, CA", "consumerReviewDate": "August 2017", "stars": 5}, {"title": "It was great working with Nate and Grander Loans", "text": "Working with Nate and Grander Loans was a great experience. Nate was professional and kept us updated throughout the refi process. He helped us secure a great rate and finally did away with that pesky PMI. I will definitely work with Nate in the future and will recommend his services to anyone looking to refi their home loan. Sergio L.", "consumerName": "Sergio", "consumerFrom": "Chula Vista, CA", "consumerReviewDate": "December 2020", "stars": 5}, {"title": "Excellent refinance experience", "text": "We refinanced our primary home & Nate is awesome, he made the process painless & easy.  Since the refinance, Nate has gone above the call of duty & has kept us informed when rates have dropped again.", "consumerName": "Terri", "consumerFrom": "Kailua Kona, HI", "consumerReviewDate": "August 2017", "stars": 5}, {"title": "I would Highly recommend going with this company ", "text": "I have worked with Nate Wells at Grander Home Loans twice now refinancing our home and I have to say the experience with Nate was Excellent! He was always professional, accurate and there to answer all my questions promptly. I have recommended him to my friends and family and would happily work with him again.", "consumerName": "Travis", "consumerFrom": "Pearl City, HI", "consumerReviewDate": "December 2020", "stars": 5}, {"title": "Great service, no pressure, transparent", "text": "Grander was not the only company to respond to our Lending Tree query, and it certainly was not one to call most often.  When we dug into the numbers, however, it had the best deal by far both as to rates and costs.  We were then pleasantly surprised by the high degree of customer service provided by Nate Wells of Grander Home Loans.  He is very responsive and transparent, with no pressure.  Grander will not be the company to call you most often after a Lending Tree query, not even close.  Other bigger companies, with names you recognize, will hound you.  Do your homework on the numbers, and rest assured with the customer service, and transparency, of Grander.  One very happy customer here.    ", "consumerName": "Patrick", "consumerFrom": "Denver, CO", "consumerReviewDate": "September 2017", "stars": 5}, {"title": "Great Company!", "text": "Nate Wells is amazing - knows his field and is an expert/professional with mortgages. He is detailed- no hidden fees and responsive to the many questions I had during the process. He is a pleasure and an asset to the mortgage industry.  He got me the best rate and is very trustworthy. Grander Homes and Nate Wells. HIGHLY RECOMMEND", "consumerName": "Patty", "consumerFrom": "Lake Forest, CA", "consumerReviewDate": "December 2020", "stars": 5}, {"title": "5 stars! - Refinance", "text": "Matt delivered on everything he said he would.  We got an amazing rate on a refi, and it happened quickly.  The only delay was waiting on an appraisal which was out of his hands.  Matt responded to calls and emails in a very timely manner.  He went over all costs in detail and was very professional.  I'm so glad we decided to go through him for our refinance.  ", "consumerName": "stan", "consumerFrom": "Cottonwood, CA", "consumerReviewDate": "September 2017", "stars": 5}, {"title": "Good Experience ", "text": "Nate Wells of Grander Home Loans is very knowledgeable and professional.  No surprises and no hidden fees.  Highly recommended!", "consumerName": "Pedro", "consumerFrom": "Lake Elsinore, CA", "consumerReviewDate": "December 2020", "stars": 5}, {"title": "Great low rate", "text": "In our refinance with Grander, we received a rate a full percentage below what my current lender offered with no points.  The process happened in a timely manner and the responsiveness of our agent (Matt) was excellent.\r\nI was reluctant to respond to an advertisement in email but I am so glad I did. \r\nClosed a month ago, payoff of old loan seems to have gone through smoothly.  Saving big time monthly now, guess I'll buy that truck.", "consumerName": "stan", "consumerFrom": "Cottonwood, CA", "consumerReviewDate": "September 2017", "stars": 5}, {"title": "Excellent Experience BOTH times for refinance of Loand", "text": "Grander Home Loans made everything so easy for me to refinance, I wasn't sure what to provide or expect and my rep. Nate walked me through every step and specifically outlined what I needed to provide and handled the rest.They got me a very competitive rate TWICE as I've used them both times that I've refinanced saving me on my mortgage as well as allowing me to get money out for a house project.I really appreciate the help and wonderful service from Grander Home Loans, I'd recommend for sure and will use again in the future if rates continue to go lower and lower", "consumerName": "Adam", "consumerFrom": "Brighton, CO", "consumerReviewDate": "December 2020", "stars": 5}, {"title": "Wealth of knowledge ", "text": "Nate Wells from Grander Home Loans has exceptional levels of professionalism, knowledge, and respect. He helped guide me through not one, but two refinances over the last few years. He answered all of my questions and made me feel like I knew all I needed to before signing anything. I shopped around for quite a while before settling on Grander; they had the best rates, prices, and staff. Nate was very responsive and easy to talk with. Thanks Nate! ", "consumerName": "Shana", "consumerFrom": "Ewa Beach, HI", "consumerReviewDate": "December 2020", "stars": 5}, {"title": "Easies Refi Ever", "text": "Nate and team have done it again, this is my second refinance with them and the process could not have been more streamlined anywhere.  Having a professional that is this responsive and thorough made the process easy and enjoyable.  ", "consumerName": "Joseph", "consumerFrom": "Bayfield, CO", "consumerReviewDate": "December 2020", "stars": 5}, {"title": "Great experience ", "text": "Nate was great to work at grander. He made the process very easy and he was great about returning calls and keeping us informed throughout the process. I highly recommend this company. Best company I ever worked with when it came to refinancing. Excellent rate no hidden fees or junk fees. ", "consumerName": "Scott", "consumerFrom": "Brighton, CO", "consumerReviewDate": "December 2020", "stars": 5}, {"title": "Awesome experience, top notch service!", "text": "Grander is an awesome company!  We have used them twice now and always impressed by their professional service, great rates, overall excellent value.  We worked with Nate Wells both times, he is truly awesome.  Even a few years after one of our refinances, we needed some documentation for something else, and Nate was glad to help and provided the documents in a flash.  Excellent customer service!  No complaints whatsoever.  Looking forward to using Grander for our next home loan.", "consumerName": "Jim", "consumerFrom": "Happy Valley, OR", "consumerReviewDate": "December 2020", "stars": 5}, {"title": "Professional, clear, open honest", "text": "Nate was great to work with. He made the whole process pretty seemless. I would definitely use them again", "consumerName": "Lea", "consumerFrom": "Bend, OR", "consumerReviewDate": "December 2020", "stars": 5}, {"title": "Best ever!", "text": "Nate Wells made our refi so smooth. No fees. No surprises. It was the best loan experience we’ve ever had!", "consumerName": "Ryan", "consumerFrom": "Burbank, CA", "consumerReviewDate": "October 2020", "stars": 5}, {"title": "5 Star Service - Nate Wells from Grander Home Loans", "text": "We highly recommend Nate Wells from Grander Home Loans for any new home purchase or re-fi.  Nate is very responsive, professional and hard working.  He always searches for the best deals and keeps you informed every step of the way.  Even if a HELOC subordination is required, he can make it happen.  We highly recommend Nate Wells and will definitely use him again in the future.  Give him a try, you won't regret it!", "consumerName": "Toni", "consumerFrom": "Kapolei, HI", "consumerReviewDate": "September 2020", "stars": 5}, {"title": "Wonderful experience, as always!", "text": "I cannot say enough about Grander Home Loans Inc.  It was a pleasure working with Nate.  He is always very responsive and explains everything very clearly.  He answers emails very quickly, and is the most patient person I have every worked with.", "consumerName": "Kathy", "consumerFrom": "Kailua, HI", "consumerReviewDate": "September 2020", "stars": 5}, {"title": "Twice is Nice", "text": "We just completed our second Refi with Nate at Grander. Enough said, we went back to Nate for his knowledge, service and always keeping us apprised of the loan terms and progress. We would rcommend him highly.", "consumerName": "jerome", "consumerFrom": "Kamuela, HI", "consumerReviewDate": "September 2020", "stars": 5}, {"title": "Quick and easy processing", "text": "This is my 2nd time using Grander Home for refinancing. It was nice working with Nate. I will not hesitate to use their service again. I also recommended Grander Home service to my friend who was also looking for refinancing.", "consumerName": "Erwin", "consumerFrom": "Gilroy, CA", "consumerReviewDate": "September 2020", "stars": 5}, {"title": "Transparent and Responsive", "text": "Grander Home Loans Inc is a great company to work with.  Nate Wells provided me with an overview of the different available options, answered all of my questions to help me select a loan, and kept me informed throughout the lending process.  I definitely recommend Grander Home Loans to borrowers who are looking for a transparent broker that is responsive.", "consumerName": "Melvin", "consumerFrom": "Palo Alto, CA", "consumerReviewDate": "August 2020", "stars": 5}, {"title": "Always a great experience ", "text": "We have used Nate at Grander Home Loans 3 times in just over a year. First, with the loan process of buying our first home and then to refinance our loan, twice. Once again, we are extremely please with the way Nate handles the process. Always informative and communicative and has never steered us wrong. We fully trust him to always get us the best deal possible and recommend Grander highly to all our friends and family. ", "consumerName": "Brooke", "consumerFrom": "Santee, CA", "consumerReviewDate": "August 2020", "stars": 5}, {"title": "Excellent and will use again", "text": "Speedy, professional, kind and knowledgeable. Will happily recommend and use again any time the opportunity arises. ", "consumerName": "Eric", "consumerFrom": "Aurora, CO", "consumerReviewDate": "August 2020", "stars": 5}, {"title": "Professional, honest, and friendly", "text": "Grander Home Loans helped finance our first home purchase, and also helped with a recent refinance.  Their service has been consistently excellent.  Nate is very knowledgeable and responds quickly to questions.  The rates he gave me were very competitive, and he was very upfront and honest about the total costs associated with each option.  I have only good experiences with them and have recommended him to my friends and family.", "consumerName": "Mark", "consumerFrom": "Los Angeles, CA", "consumerReviewDate": "August 2020", "stars": 5}, {"title": "Amazing from start to finish", "text": "Huge thanks to Dustin Beerman at Grander for making the ReFi process a smooth one from the starting block to the finish line.  Highly responsive and kept me informed every step of the way.  Aug 5 we locked in rate & ran credit report the deal was funded Aug 25.  All the while having the most competitive closing costs against the 5 other companies I researched.  Keep in mind this is a partnership between the client and broker.  Having all your personal documents in order and ready to share are essential to success. Thanks again Dustin, now I have to figure out what to do with my $459/month positive cash flow thanks to my straight ReFi (no cash out).", "consumerName": "Derek", "consumerFrom": "Portland, OR", "consumerReviewDate": "August 2020", "stars": 5}, {"title": "2nd Refi", "text": "Nate does it again! This is our second refi with Grander Home loans and it has been a pleasure again! Seamless, fast, great communication, thorough, professional - these are just some words to describe Nate and his team. ", "consumerName": "Daniel", "consumerFrom": "Brighton, CO", "consumerReviewDate": "December 2020", "stars": 5}, {"title": "Amazing Experience", "text": "We have had the privilege of working with Nate Wells and Grander Home Loans twice in the last 12-18 months.  Most recently he assisted us with re-financing our home.  His level of detail, professionalism, responsiveness and thoroughness is top notch.  He made the entire process from beginning to end seamless and unbelievably easy for us.  We would not hesitate to use him aga****.in fact, we would go out of our way to find him and work with him again!  THANK YOU NATE!", "consumerName": "Shelly", "consumerFrom": "Littleton, CO", "consumerReviewDate": "November 2020", "stars": 5}, {"title": "3rd Re-Fi with Grander Home Loans", "text": "Our 1st Re-Fi was excellent... and the 2nd and 3rd were even better!You won’t find ANY better customer service and personal attention to detail from any business than you will get from Nate W. at Grander Home Loans!", "consumerName": "LaRon", "consumerFrom": "Salem, OR", "consumerReviewDate": "November 2020", "stars": 5}, {"title": "Responsive and Great Service", "text": "Nate was great to work with. Our Refi was smooth and efficient. Nate walked us through everything and answered any of our questions. Would be happy to use him and Grander Loans again. Got us a rate that no one else we shopped with could match and never had any pressure from them. Thanks.", "consumerName": "Thomas", "consumerFrom": "Bend, OR", "consumerReviewDate": "October 2020", "stars": 5}, {"title": "Great company!!", "text": "One of the best loans companies that I have worked with. Nate Wells delivers exactly what he promises, stays in contact throughout every step of the process and makes sure that there are not surprises at the end. I will surly return to Grander Home Loans and recommend anyone needing home loans services to call Nate. You will not be disappointed.  ", "consumerName": "Lawrence", "consumerFrom": "Kailua Kona, HI", "consumerReviewDate": "October 2020", "stars": 5}, {"title": "Another Great Loan!", "text": "Nate at Grander Home Loans, Inc. has worked with us to successfully lower not only our rate but the length of our loan for the 3rd time! He contacted us for the 2nd ReFi to let us know that the rates had dropped and gave us multiple options from a 15 year loan down to a 10 year. Nate answered any questions we had and timely with the time zone difference. I highly recommend doing business with Grander Home Loans and Nate.", "consumerName": "Robert", "consumerFrom": "Mililani, HI", "consumerReviewDate": "October 2020", "stars": 5}, {"title": "Awesome experience - repeat customer", "text": "We’ve worked with Nate twice now, and we have recommended him to several of our friends. He’s a great communicator and made everything super clear and understandable. He followed up regularly throughout the process and was always available if we needed to reach him. We would highly recommend working with Nate and Grander!!", "consumerName": "David", "consumerFrom": "Colorado Springs, CO", "consumerReviewDate": "October 2020", "stars": 5}, {"title": "Great experience!", "text": "I would definitely recommend Nate and Grander Loans. We started the refinance process with a different broker, and were stuck going nowhere for over 4 months!! Switched here to Nate after my sister had a positive experience and recommended him, and he was able to get our refinance done it less than half the time we had wasted with the prior broker, and at a lower interest rate, lower cost to us, and ultimately lower monthly mortgage payments! It did take a couple of weeks longer than first expected, due to hold ups on the lender's end that were out of both of our control, but Nate kept us updated throughout the entire process, which was by far the smoothest refinance we have done to date. I doubt we will ever need another refinance, since our rate is so low, but if we ever do, or end up buying a different home, we will definitely use Nate again! ", "consumerName": "Markelle", "consumerFrom": "San Juan Capistrano, CA", "consumerReviewDate": "October 2020", "stars": 5}, {"title": "Highly recommend", "text": "This is my first time working with Grander Home Loans Inc. and I highly recommend them.  I worked with Nate Wells.  He was very informative from start to close and kept me up to date throughout the process.  He even emailed and/or texted me every friday to touch base even if there wasn't any movement.  This re-assured me that he was on top of it and was actively tracking the progress of my refi.  Thanks Nate for all your help!", "consumerName": "Allan", "consumerFrom": "Chula Vista, CA", "consumerReviewDate": "October 2020", "stars": 5}, {"title": "Excellent!!", "text": "I pretty much sat back and Nate did all the work. Especially since we were thousands of miles away.  He promised me to get me to where I wanted to be, which was closing my loan.  You won’t regret going with this Grander Home Loans!!  ", "consumerName": "Leon", "consumerFrom": "Ewa Beach, HI", "consumerReviewDate": "October 2020", "stars": 5}, {"title": "So Good I Felt Like Family", "text": "Nate Wells and Grander made things so easy with such great results I felt like I was being treated like a family member!  Nate got me a better rate than we started with, which was already lower than any other.  He was constantly in touch, walking me through every step.  There were no surprises, well other than getting the lower rate and being so happy with the whole experience.  Past real estate loans have always been painful, slow or even failed.  Nate made this time a pleasant experience, one that I will reach out to him to duplicate in the future.  I have already recommended him to my best friend and others.  Try Nate/Grander out, you won't be sorry.", "consumerName": "David", "consumerFrom": "Fremont, CA", "consumerReviewDate": "March 2020", "stars": 5}, {"title": "Good Experience.  ", "text": "I am so happy that I was referred to Grander Home Loans and for the customer service Nate Wells gave me during the refinance of my home.  I felt Nate was very professional.  He explained every stage in the refinance, and when I didn't understand; he took the time to explain everything.  In the end; I actually got a better deal than I had anticipated.  I felt Nate Wells put a personal touch to the process.  I am extremely satisfied and would recommend Grander Home Loans to anyone.  I have told  several people that I work with about them.  Francisco in Hawaii.  ", "consumerName": "Francisco", "consumerFrom": "Kailua Kona, HI", "consumerReviewDate": "March 2020", "stars": 5}, {"title": "Excellent Experience", "text": "Nate was extremely helpful and communicative through the whole process of our mortgage refinance. We would definitely work with Grander again.", "consumerName": "Dan", "consumerFrom": "Portland, OR", "consumerReviewDate": "February 2020", "stars": 5}, {"title": "Competitive Rates, Easy Process", "text": "Great rates.  Amazing communication.  Fast close, zero hassles.  We highly recommend Dustin at Grander Home Loans.", "consumerName": "Nate", "consumerFrom": "Aurora, CO", "consumerReviewDate": "February 2020", "stars": 5}, {"title": "Outstanding!!!", "text": "We've had the pleasure of working with Nate Wells for several years on all of our home loans. Grander Home Loans was an outstanding choice for our home loans and will be for all future home finances. From the start, Nate worked diligently to help us prepare what was needed and made the process effortless each time.  Nate went above and beyond to share his knowledge and make sure we had all of our questions answered. I couldn’t recommend him enough!Thank you, Nate, for all your hard work!", "consumerName": "Michael", "consumerFrom": "Salem, OR", "consumerReviewDate": "February 2020", "stars": 5}, {"title": "If Grander Home Loans is calling you, answer the call", "text": "I highly recommend Grander Home Loans to anyone seeking a new home loan or refinancing their existing home loan. Nate and his team were fantastic, responsive and on the top of everything throughout the process. From the moment I first got a solicitation call to see if I was interested in refinancing my existing VA loan to the day of the closing, I just sat back while Nate and his team worked diligently for me to get the best rate that I could get. I will put it this way, the rate and the overall deal that Nate and his team gave me without any back and forth was better than the best deal I could get from my existing lender after months of negotiations, that they themselves backed out of as the current economic slump hit. What I found to be really amazing is that Nate and his team pulled this off during one of the worst economic situations imaginable. Thank for your effort Grander Home Loans. I am glad I gave you my business.", "consumerName": "Sumit", "consumerFrom": "Happy Valley, OR", "consumerReviewDate": "June 2020", "stars": 5}, {"title": "Easy to work with. ", "text": "Excellent service. I’ve worked with Grander for past several years. They’ve done two mortgages and a few Re-Fi for me. Always fast, efficient, minimum paperwork and hassle. Always answer my calls and emails promptly. Best of all I always get the best rate available. Highly recommend. ", "consumerName": "Julie", "consumerFrom": "Long Beach, CA", "consumerReviewDate": "February 2020", "stars": 5}, {"title": "It was a very smooth process", "text": "The entire process of refinancing our current mortgage was smooth and easy. We worked with Dustin and highly recommend him and Grander Homes.", "consumerName": "Tina", "consumerFrom": "Eugene, OR", "consumerReviewDate": "May 2020", "stars": 5}, {"title": "Great Experience", "text": "Outstanding!  Nate Wells is knowledgeable, trustworthy and helpful.  I highly recommend Grander Home Loans Inc.", "consumerName": "Lorraine", "consumerFrom": "Menifee, CA", "consumerReviewDate": "January 2020", "stars": 5}, {"title": "Trustworthy professionals ", "text": "Worked with Nate @ Grander Home Loans again to refi our primary resident. It was a quick and smooth transaction, and Nate kept us informed every step of the way. We have been working with Grander for nearly 6  years, and have recommended them to family and close friends. Highly recommend their team. We instructed Nate to keep on eye on interest rates in case we might benefit from another refi! ", "consumerName": "Jonathan", "consumerFrom": "Richmond, CA", "consumerReviewDate": "May 2020", "stars": 5}, {"title": "Excellent", "text": "excellent service and very fast closing.  Dustin is very knowledgeable and always response quickly.  I will use the service again in the future.", "consumerName": "Hanny", "consumerFrom": "Beaverton, OR", "consumerReviewDate": "January 2020", "stars": 5}, {"title": "Excellent refi experience!", "text": "I refinanced my home loan with Grander and couldn't be more pleased with my experience. There were no surprise costs or fees. All promises made up front were fulfilled. Jevon did an excellent job at guiding me through the process. He was very responsive, thorough and clear about the rate, fees and terms of the loan.  In addition, Jevon was able to provide me with unexpected credits during closing. Highly recommended!", "consumerName": "Susan", "consumerFrom": "San Anselmo, CA", "consumerReviewDate": "October 2017", "stars": 5}, {"title": "Nate was amazing!", "text": "Nate was amazing!  I told him what I wanted from my refi and he watched the market for me and locked me into a great rate!  Process was all online until final document signing and the signer came to my house!Thanks again Nate !Mark Schmidt", "consumerName": "MARK", "consumerFrom": "Poway, CA", "consumerReviewDate": "May 2020", "stars": 5}, {"title": "Nate Wells is the best I've worked with", "text": "I recently completed my second refinance with Nate Wells.  He is an exemplary agent.  I am very pleased and happy with how both refis were completed with ZERO hassles.  I can't give Nate enough praise.  He is very professional and always keeps his word.  And the rates and fees can't be beat to top it off!", "consumerName": "elizabeth", "consumerFrom": "Roseburg, OR", "consumerReviewDate": "October 2017", "stars": 5}, {"title": "Refi.", "text": "Nate Wells did an excellent job!  Explained every step and everything on the paperwork, so there was no surprise at the end.  Very fast, very well done. Thank you. ", "consumerName": "Lawrence", "consumerFrom": "Kailua Kona, HI", "consumerReviewDate": "January 2020", "stars": 5}, {"title": "Different States did not change the service!", "text": "Being in a different State, Grander Home Loans, was still able to help get a lower rate and at the best possible deal on the market! Thank to their team and Nate (who handles CO)! It was the easiest refinance I have had. Nate was very communicative during the process and things got done right away!", "consumerName": "Daniel", "consumerFrom": "Brighton, CO", "consumerReviewDate": "April 2020", "stars": 5}, {"title": "Professional and honest", "text": "Nate from Grander Home Loans is wonderful to work with.  He was patient, helpful, and at all times professional.  I was very satisfied with the mortgage I got.  About a half a year after the mortgage, Nate called me up out of the blue to let me know that interest rates had actually dropped.  He refinanced the mortgage for free so I could take advantage of the lower interest rate.", "consumerName": "Mark", "consumerFrom": "Los Angeles, CA", "consumerReviewDate": "February 2018", "stars": 5}, {"title": "Refinance", "text": "Nate, was great to work with, quick and thorough on every aspect of the loan process.  Definitely would use him again.", "consumerName": "Thomas", "consumerFrom": "La Mesa, CA", "consumerReviewDate": "January 2020", "stars": 5}, {"title": "Highly Recommend!", "text": "I worked with Jevon Hobbiebrunken. Not only did Jevon find us the best VA rates and fees, his response to my questions were detailed and got back to me in a timely manner. Jevon at Grander Home Loans was great to work with. He made sure our loan process went smoothly, from the 1st txted to the closing process. We plan to work with Jevon in the future and would definitely recommend him to all our friends and family. Thank You Jevon,  for all of your great work! ", "consumerName": "Lucy", "consumerFrom": "Salinas, CA", "consumerReviewDate": "January 2020", "stars": 5}, {"title": "Awesome service!", "text": "If I could leave 6 stars I would! I have refinanced with Nate a couple times now and every time the process has been smooth, and very beneficial financially! Highly highly recommend!", "consumerName": "Cristina", "consumerFrom": "Tualatin, OR", "consumerReviewDate": "April 2020", "stars": 5}, {"title": "Great guy", "text": "Nate is very honest, professional, and checked in frequently to make sure everything was going smoothly.", "consumerName": "Mark", "consumerFrom": "Los Angeles, CA", "consumerReviewDate": "February 2018", "stars": 5}, {"title": "Excellent Service", "text": "Every step of the way I felt taken care of, responded to quickly, aided in understanding the entire process, and advised without any pressure. Grander was a pleasure to work with and specifically Jevon Hobbiebrunken. I chose them over the other companies because they had a variety of rates to chose from and they were the best rates of the companies I was contacted by. I recommend them wholeheartedly and would definitely go to them for all my mortgage needs.", "consumerName": "Emily", "consumerFrom": "Chico, CA", "consumerReviewDate": "January 2020", "stars": 5}, {"title": "Smooth refiancne", "text": "I worked with Nate Wells on a refinance. I could not have been happier with his level of service, professionalism, patience and pricing. I have referred friends and family to Nate because of how happy I was with my refinance. I will use Nate in the future for any mortgage needs. ", "consumerName": "Jerry", "consumerFrom": "Rancho Cucamonga, CA", "consumerReviewDate": "January 2020", "stars": 5}, {"title": "great experience", "text": "Mr Wells gave us great service, made it easy to understand and answered all our questions/concernsand kept us informed all the way.", "consumerName": "Adriana", "consumerFrom": "San Diego, CA", "consumerReviewDate": "April 2020", "stars": 5}, {"title": "Good rate, good service", "text": "I was very pleased by how fast and painless this process was.\r\nThe initial quote only took a few minutes, with no credit pull required, and low-pressure.\r\nThe rate and closing costs were tied for the lowest I had encountered in my search.\r\nI was able to get an appraisal waiver, saving even more time and money.\r\nNate provided me with frequent and easy to understand updates.\r\nThe final signing was easy to schedule - a mobile notary met me at my home.\r\nFrom start to finish the process took under a month.\n", "consumerName": "Kyle", "consumerFrom": "Portland, OR", "consumerReviewDate": "February 2018", "stars": 5}, {"title": "Easy and helpful", "text": "Nate was great to work with. Provided options and advice as requested without being pushy. Highly recommend", "consumerName": "Robert", "consumerFrom": "Aurora, CO", "consumerReviewDate": "January 2020", "stars": 5}, {"title": "Very pleased with Grander Home Loans and will use them again ", "text": "We have been thoroughly impressed with Grander Home Loans. I initially collected information from 5 different lenders and it became pretty obvious early on that they were the one to use. They got us the lowest rate, were very transparent and gave us several options depending on our needs. While I realize this isn't the norm, we could have probably closed much faster if it didn't take us a few extra days to gather all of the information. Still only took about 3 weeks from start to finish. Highly recommended.", "consumerName": "Eric", "consumerFrom": "Erie, CO", "consumerReviewDate": "March 2020", "stars": 5}, {"title": "Quick and Easy", "text": "Matt was very knowledgeable and handled my loan efficiently and as stated. There were no fees, and he got it taken care of in 3 weeks. I would recommend Matt to all my friends.", "consumerName": "Karen", "consumerFrom": "Auburn, CA", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Highly Recommend!", "text": "My husband and I have worked with Nate Wells on refinancing our two homes. Not only did Nate find us the best rate and fees, his response to my endless questions over the few months has been prompt and detailed. My husband and I have worked with many lenders to finance/ refinance our 3 homes and it was always a nightmare to work with horrible lenders. Nate at Grander Home Loans made the loan process a simple, stress-free experience. We plan to work only with Nate in the future and would definitely recommend him to our friends and families. Nate, thank you for your patience and attention to details! ", "consumerName": "michelle", "consumerFrom": "Cypress, CA", "consumerReviewDate": "December 2019", "stars": 5}, {"title": "We cannot recommend Grander enough!", "text": "Nate and his team at Grander Home Loans were all amazing to work with! We used Grander as first time home buyers as well as to refinance our loan six months later and could not be more pleased both times around. As first time home buyers we had a LOT of questions that Nate was always happy to answer to make us feel comfortable through out the entire process. They stayed on top of everything making things go as smooth and as quick as possible, always staying in contact making sure we were always informed every step of the way. We did a lot of research to find the best rates and trust me when I say you will not find a better rate than the rate Nate finds for you. And on top of good rates you get great communication and comfort. ", "consumerName": "Brooke", "consumerFrom": "Santee, CA", "consumerReviewDate": "March 2020", "stars": 5}, {"title": "Amazing experience!", "text": "I have worked with Nate Wells on two home loan refinances and have had an amazing experience both times. He is very responsive and is extremely transparent and communicative at each step of the process.  And, they have the best rates and fees around. I couldn't be happier! I will undoubtedly go to Nate at Grander Home Loans Inc for all of my home lending needs - and I will (and have already) recommend them to friends and family. Thank you, Nate, for all of your great work! We really appreciate you!", "consumerName": "Bethany", "consumerFrom": "West Linn, OR", "consumerReviewDate": "December 2019", "stars": 5}, {"title": "Would 100% work with again", "text": "Nate and Kelsey (our processor) at Grander Home Loans are amazing. We finally decided to refinance our house, and they had it done from our initial questions (before we even decided to go through with it) to funded in less than 4 weeks.During that time, Nate was super on top of everything, responded to our questions right away (and thoroughly), and made sure to get us the best rate possible.He gave us multiple options, and a lower rate than we found anywhere else. Plus, it seemed like a very fair amount in broker fees.We absolutely will recommend GHL to anyone looking to purchase or refinance, and would use them again in the future.", "consumerName": "Teresa", "consumerFrom": "National City, CA", "consumerReviewDate": "March 2020", "stars": 5}, {"title": "Excellent experience! Highly recommend! ", "text": "My husband and I just bought our first home and were referred to Nate and couldn’t have been happier with our experience. He was diligent in answering all of our questions and getting back to us in a timely matter. (Including after hours or on weekends)Even if there was an item he had to look into, he would still reply right away and let us know he was working on it. He’s honest, hard working and a genuine guy. Would highly recommend him if your looking to buy or refinance! ", "consumerName": "Peyton", "consumerFrom": "Escondido, CA", "consumerReviewDate": "December 2019", "stars": 5}, {"title": "Great Experience!", "text": "Dustin Beerman with Grander Home Loans made my entire process a breeze. He responded to all my emails right away and sometimes it seemed he was always working, even on weekends. I got a great rate refinancing my mortgage and the closing costs were less than other companies I had spoken with. I didn't even have to leave my home to close, as the notary came to me. That was really great as I live pretty far from the Title company. I will definitely call Dustin and Grander Home Loans next time am shopping for a mortgage or a loan.", "consumerName": "Jill", "consumerFrom": "Aurora, OR", "consumerReviewDate": "December 2019", "stars": 5}, {"title": "Great experience with Grander", "text": "Working with Dustin and his team on my ReFi was great, both from a financial perspective as well as a customer service one.  The Grander team was responsive, hard working and were able to provide quality options which allowed us to achieve our mortgage goals.  I would recommend Grander to anyone without reservation.", "consumerName": "Andrew", "consumerFrom": "West Linn, OR", "consumerReviewDate": "December 2019", "stars": 5}, {"title": "Great experience", "text": "quicGrander Home Loans reached out to me and was very patient while I needed to wait for the final on our home. The loan officer followed up without being pushy. The final approval came in less than 24 hours after all my documents were submitted. ", "consumerName": "Karen", "consumerFrom": "Auburn, CA", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Best 5-Star Service", "text": "Knowledgeable, Honest, Top Of Their Game.Nate Wells and his team made the process quick, painless and kept every promise. ", "consumerName": "Douglas", "consumerFrom": "Kailua, HI", "consumerReviewDate": "December 2019", "stars": 5}, {"title": "Great experience ", "text": "We worked with Jevon to refi three properties and were impressed by his honesty and integrity. He delivers on his promises and is responsive and professional in his communication. We asked a lot of questions, and he always replied in a friendly professional manner. I have recommended Jevon to my close friends, neighbors, and family. More over, I have returned to Jevon for possible repeat business as I consider purchasing more real estate! ", "consumerName": "Jonathan", "consumerFrom": "Berkeley, CA", "consumerReviewDate": "April 2018", "stars": 5}, {"title": "Grander Knows What They're Doing", "text": "Nate and Mike were both extremely helpful, professional and courteous. Nate, the president of the company was able to handle my very complicated refinance in ways that others were not able or willing to help. He bent over backward to find the best rate with the lowest fees as well.\r\nDefinitely will use Grander again. ", "consumerName": "Kathy", "consumerFrom": "La Quinta, CA", "consumerReviewDate": "June 2018", "stars": 5}, {"title": "Grander Exceeded My Expectations", "text": "I reached out to Grander after seeing its great rates and great reviews, but I have to say after getting some bait-and-switch quotes from bigger lenders I didn't have high hopes. However, Nate and Grander Loans far exceeded my expectations. Right from the get-go Nate was honest and responsive, and not the least bit high pressure. He always responded immediately to my questions, was very clear about the process every step of the way, and even got me a better deal than he originally quoted. He treated me with honesty and integrity, and made my refi process stress-free. ", "consumerName": "Danielle", "consumerFrom": "Portland, OR", "consumerReviewDate": "October 2018", "stars": 5}, {"title": "Nate Rocks", "text": "Nate with Grander Home Loans went above an beyond. Not only did he answer all my questions in detail, he did it at any hour of the day that I happened to email. Grander is a small firm that values quality of quantity and they were able to score me a great rate on a refinance and their fees were the best I've seen. Elsewhere the return on investment for a refinance in my situation was 2-5 years but with Grander it was less than a year. Since they're not exclusive to any one lender they will always find you the best deal, for the best price, with the best fees. Thanks again. ", "consumerName": "Ash", "consumerFrom": "Denver, CO", "consumerReviewDate": "December 2019", "stars": 5}, {"title": "Very satisfactory experience", "text": "Grander Home Loans offered and produced the best rates and terms from among many other mortgage brokers, providing good customer service throughout the process.  A very satisfactory experience from start to finish.", "consumerName": "Kevin", "consumerFrom": "Pauma Valley, CA", "consumerReviewDate": "December 2019", "stars": 5}, {"title": "An outstanding experience with Grander Home Loans", "text": "Our experience with Grander Home Loans and broker Matt Gibbons was extraordinary, exceeding our expectations! My wife and I worked with Matt on two refinances, and he was always very clear about setting expectations for the process, took the time to answer all of our questions in detail, and kept us up to date the entire time. One of the loans became pretty complex, and Matt went above and beyond to resolve a series of problems on our behalf. I completely trusted Matt knowing that he was always working in our best interests. I highly recommend Grander Home Loans and Matt Gibbons. ", "consumerName": "Eric", "consumerFrom": "Oakland, CA", "consumerReviewDate": "December 2019", "stars": 5}, {"title": "Excellent Service!", "text": "Excellent Service! I came to know about Grander Home Loans Inc, through a family member, who recommended the company in assisting me in my hopes to refinance. My representative was Nate Wells!  Wow, the knowledge that he gave, the encouragement when I wanted to give up, when I thought it was impossible, he never lost site of goal to get me loan type that I wanted. He listened and made suggestions, which resulted in me getting the loan type, interest rate, lower mortgage payment and some cash back! Never, did I have to wait to hear from him or Grander Home Loans Inc, regarding this process of the next steps or what was needed. I will be recommending Grander Home Loans Inc, to my friends and family. This is from a happy excited satisfied customer!", "consumerName": "Valerie", "consumerFrom": "Aurora, CO", "consumerReviewDate": "December 2019", "stars": 5}, {"title": "It was an excellent experience.", "text": "We are very satisfied with the excellent service Nate Wells made on our home mortgage refinancing. He is very knowledgeable on this field.  He gave us a lot of options to choose from. We are very comfortable talking to him. He answers all our questions promptly. Thank you so much Nate Wells for the excellent service you have given us on our home mortgage refinancing. For guiding us all the way on its step by step process. More power to Grander Home Loans, Inc.Highly recommended. ", "consumerName": "MariaThere", "consumerFrom": "Antioch, CA", "consumerReviewDate": "December 2019", "stars": 5}, {"title": "Awesome experience", "text": "Nate W. / Grander Homes was excellent to work with. Anytime I called, Nate always answered and took the time to explain everything thoroughly.  I have refinanced twice with Grander Homes and would not hesitate to do it again. ", "consumerName": "LaRon", "consumerFrom": "Salem, OR", "consumerReviewDate": "November 2019", "stars": 5}, {"title": "Excellent!", "text": "Nate was awesome. I was having issues with another lender regarding my solar lien, but Nate saved the day with the best rates I could find and great customer service.", "consumerName": "Jason", "consumerFrom": "Parker, CO", "consumerReviewDate": "November 2019", "stars": 5}, {"title": "Quick, easy, and money saving!", "text": "Grander was a tremendous help to me with my refinance loan. This is my second refinance, and the process was so smooth and easy this time. Nate ensured I didn't have to bring any money to the table, and in fact, helped me walk away with some cash in my pocket all while lowering my monthly payment!! When I tried contacting the larger banks about my refinance loan, I was stuck on hold for 30 minutes or more before speaking with someone and I was stuck with a random mortgage agent every time. It was nice to have Nate's direct number and email address if I needed to reach him at any time. However, he was very good about emailing and calling me with frequent updates during my application and funding process. His efficiency helped me close the same month I started the application. I wholeheartedly recommend using Grander for your next mortgage or refinance loan. ", "consumerName": "April", "consumerFrom": "San Diego, CA", "consumerReviewDate": "November 2019", "stars": 5}, {"title": "Second Loan through Grander!", "text": "Nate Wells and Grander HOme Loans have secured two great loans for me. Both time they were not only the best rates the customer service was also the best. Highly recommend Grander Home Loans.", "consumerName": "David", "consumerFrom": "Portland, OR", "consumerReviewDate": "November 2019", "stars": 5}, {"title": "Great Refinance Experience", "text": "Working with Grander Home Loans was a pleasant and painless experience for our VA refinance in Colorado.  Nate was amazing at communication and the process was straight forward and most importantly, successful.  Consider putting Grander Home Loans at the top of your list for your home loan needs.", "consumerName": "Greg", "consumerFrom": "Florissant, CO", "consumerReviewDate": "November 2019", "stars": 5}, {"title": "Nate Wells", "text": "Nate W---- is AMAZING!  He was on top of EVERYTHING EVERY STEP OF THE WAY, and I NEVER had to wait on any new information!!  He made the process ENTIRELY EASY!!!  I HIGHLY RECOMMEND Nate!  I will be sure to recommend when someone I know is looking to refinance!", "consumerName": "Nancy", "consumerFrom": "Aurora, CO", "consumerReviewDate": "November 2019", "stars": 5}, {"title": "Very Pleased", "text": "Nate and Team at Grander  where extremely easy to work with on the refinancing of my home mortgage. Communication was real time and you always felt that they were working on your behalf to get the best rate in the most expedient way. Without a doubt I will be utilizing their services again! ", "consumerName": "Gary", "consumerFrom": "Altadena, CA", "consumerReviewDate": "November 2019", "stars": 5}, {"title": "great experience!", "text": "Nate Wells was wonderful to work with again.  Every aspect was handled quickly and efficiently and couldn't have gone any smoother.  I would not hesitate to recommend Nate and Grander Home Loans to family, friends or anyone who needs a mortgage.", "consumerName": "debbi", "consumerFrom": "Waterford, MI", "consumerReviewDate": "November 2019", "stars": 5}, {"title": "Truly the BEST", "text": "We worked with Nate at Grander Home Loans to refinance our home on three separate occasions.  Nate is amazing!  He made the entire process effortless for us.  He kept us informed at each stage of the loan and found the best rate each time.  With all the homes we have bought and sold over the years we have never worked with a company so proactive and accommodating.  Nate is kind, sincere, trustworthy and professional.  Grander Home Loans is truly the BEST!  ", "consumerName": "Wendie", "consumerFrom": "Atascadero, CA", "consumerReviewDate": "November 2019", "stars": 5}, {"title": "GREAT CUSTOMER SERVICE!", "text": "I recently refinanced my home with Grander Home Loans. They contacted me through Lending Tree.I had never heard of them, and I was a bit skeptical. Boy, was I in for a surprise. They were the greatest company to work with. They couldn't have been any nicer, Everything was explained in great detail, replies to my emails were answered instantly, and the whole timing of the loan closing was amazing. I worked with Jevon. He was the most pleasant, knowledgeable, skillful personI have worked with. I would go back to them in a heartbeat.!!", "consumerName": "Nancy", "consumerFrom": "Portland, OR", "consumerReviewDate": "November 2019", "stars": 5}, {"title": "It was a good experince", "text": "The loan officer I worked with was honest, friendly, and completed the transaction exactly as he promised. I have worked with several other companies on this and he was by far the best. I am not sure if names are allowed on here but, Nate was a really great person to work with. ", "consumerName": "Benjamin", "consumerFrom": "Salem, OR", "consumerReviewDate": "October 2019", "stars": 5}, {"title": "Glad we picked Grander", "text": "When I started looking for a refi I entered my info in a request form (that was a mistake) and was bombarded with calls.  Luckily for me Nate Wells from Grander was one of the first.  I kept working with Grander, a national company and one local to Denver.  Grander was easier to work with, returned calls and there were zero surprises at closing.  Really glad to have worked with Nate and Grander Home Loans.", "consumerName": "Mike", "consumerFrom": "Parker, CO", "consumerReviewDate": "October 2019", "stars": 5}, {"title": "Would use again ", "text": "Nate was great. My background is in finance and I am inherently skeptical - especially when this amount of money is involved. That being said, Nate earned my trust. He spoke with me at odd hours to accommodate my schedule, and he closed ahead of time and way under what I was initially quoted. Refinancing with Grander is saving me thousands of dollars a year and had a payback period of only a few months. Very happy with this place. Would use again and recommend to my friends.", "consumerName": "Dave", "consumerFrom": "Beaverton, OR", "consumerReviewDate": "October 2019", "stars": 5}, {"title": "Fantastic Experience!", "text": "Grander Home Loans have been fantastic!  Especially Nate.  The process of home loans in the past have always been headaches but working with Nate has been the smoothest process ever.  Nate gives me scenarios based on my needs without any pressures or commitments.  He is always at your best interest and I completely have faith and trust in him***.thank you for you have done for us its well appreciated!", "consumerName": "Rudy", "consumerFrom": "Northridge, CA", "consumerReviewDate": "October 2019", "stars": 5}, {"title": "Great experience!", "text": "The follow up from my agent was like nothing I ever experienced.  It was immediate and prompt!  The rates were highly competitive and the speed of service was faster than the current industry standard.", "consumerName": "Tucker", "consumerFrom": "Los Angeles, CA", "consumerReviewDate": "October 2019", "stars": 5}, {"title": "A very pleasant experience", "text": "Nate was fantastic. This was the smoothest, easiest loan process I've ever experienced.Communication was straight-forward and clear. The process was straight-forward and clear.Nate provided me with refinance options, I chose one, and he walked me through every step. Soon enough, we were finished and I am saving money.Fees were very reasonable.I recommend Grander Home Loans to friends and family.The level of professionalism was impressive.", "consumerName": "Matthew", "consumerFrom": "Redondo Beach, CA", "consumerReviewDate": "October 2019", "stars": 5}, {"title": "Terrific Experience!", "text": "I have worked with Nate at Grander Home Loans on several occasions over the last year as he is a true professional who consistently exceeds all expectations. Thank you Nate for all that you have done for me and my family!", "consumerName": "Ryan", "consumerFrom": "Kealakekua, HI", "consumerReviewDate": "October 2019", "stars": 5}, {"title": "Nate was Great!", "text": "Nate with Grander Homes went above and beyond!  He patiently followed rates until they dropped enough and then locked us in.", "consumerName": "Mark", "consumerFrom": "Poway, CA", "consumerReviewDate": "September 2019", "stars": 5}, {"title": "Reliable and honest", "text": "We have worked with Grander Home Loans for several years, and they have been wonderfully professional, honest, and effective communicators. I liked their service so much, I recommended them to my sister, who purchased, and then refinanced with them. I highly recommend them, because they are honest, which is the singular most important value in dealing with a mortgage broker. We have worked with Jevon in the past, and most recently with Nate, and both have been super! Do your self a favor and start your mortgage financing process here. ", "consumerName": "Jonathan", "consumerFrom": "Richmond, CA", "consumerReviewDate": "September 2019", "stars": 5}, {"title": "Great, smooth refinance experience with Grander", "text": "We worked with Nate at Grander Home Loans on our refinance. It was a very quick and easy process all the way through. Nate was very responsive and Grander had very competitive rates and terms. Highly recommend.", "consumerName": "CONNOR", "consumerFrom": "Portland, OR", "consumerReviewDate": "September 2019", "stars": 5}, {"title": "Truly outstanding experience", "text": "We recently refinanced our mortgage with Grander Home Loans.  Dustin and team took great care of us, kept us well informed, and were a pleasure to work with.  The entire process was so easy and quick!", "consumerName": "Tom", "consumerFrom": "Parker, CO", "consumerReviewDate": "September 2019", "stars": 5}, {"title": "Good experience working a refinance", "text": "Nate of Grander Home loans was a pleasure to work with.  When I wanted to refinance at the lower rates & get lower payments, he helped me through the process at very little upfront cost to me.  He was just a pleasure to work with.  I'd highly recommend working with Grander Home loans.  I'd work with Nate again if the time comes.  ", "consumerName": "Carly", "consumerFrom": "Honolulu, HI", "consumerReviewDate": "September 2019", "stars": 5}, {"title": "Great", "text": "Working with Nate and Gander Home Loans was a very pleasant experience. He was able to get us the best rate possible and was always very transparent and upfront. Saved us a lot of money without making this a headache like previous experiences with other companies. Strongly recommend  Brad", "consumerName": "Brad", "consumerFrom": "Aurora, CO", "consumerReviewDate": "September 2019", "stars": 5}, {"title": "Working with Grander Home Loans, Inc made our refi a breeze!", "text": "We just completed our second refinance loan with Jevon at Grander Home Loans, Inc, and we can't say enough good things about Jevon and the process.  The online paperwork was easily accessible, and Jevon kept in touch with us at every step, patiently answering our questions and clarifying the numbers for us.  He found us a great lower rate at costs far below other lenders and was willing to work on the terms to meet our needs.  If you are looking for quality service and an exemplary and professional team, this is your company to go for a home loan.  ", "consumerName": "Susan", "consumerFrom": "Coronado, CA", "consumerReviewDate": "September 2019", "stars": 5}, {"title": "Not enough stars", "text": "We’ve worked with Nate Wells from Grander Home Loans not once, but twice and we couldn’t be more pleased.  Our first re-finance, we were shopping for lower rates and was actually told by another company that they could not help us due to our debt.  We found Nate and not only did he help us get a lower rate, but he helped us pay off most of our debt! It didn’t stop there. When rates dropped again, Nate reached out to us and we were able to save a considerable amount on our monthly- all in two weeks! We couldn’t be more satisfied. If you’re looking for a knowledgeable professional who truly cares, look no further.  ", "consumerName": "GAB", "consumerFrom": "Carlsbad, CA", "consumerReviewDate": "September 2019", "stars": 5}, {"title": "Exceptional Service at Unbeatable Rates", "text": "Grander Home Loans offered excellent service at rates that simply could not be beat. Nate was friendly, well informed, and professional, offering clarity to an often convoluted process that made it easy to comprehend at every stage. He has my highest recommendation, and if/when the future need arises, I will not hesitate to reach out to him and his exceptional team.", "consumerName": "Steven", "consumerFrom": "San Clemente, CA", "consumerReviewDate": "September 2019", "stars": 5}, {"title": "Most competitive and painless process ", "text": "This was the best mortgage origination process I’ve experienced. Grander Home Loans has the most competitive rates and terms for what we needed.  Dustin made the whole process very quick and easy. He was also very trustworthy and responsive. I highly recommend them. ", "consumerName": "Jeff", "consumerFrom": "Granite Bay, CA", "consumerReviewDate": "August 2019", "stars": 5}, {"title": "Top Notch!!", "text": "If I could give Nate 10 stars I would. I’ve worked with him and Grander Home Loans twice now (both refinances) and have had nothing but outstanding experiences both times. Nate is helpful, knowledgeable, kind, patient, and looks out for his clients. I cannot say enough wonderful things about him. To top it off, the rates he can offer are extremely com**********.the first time we refinanced I even checked with the loan officer I used for my home purchase (as a courtesy) to see what she could offer for a refi and SHE even said (after seeing Grander’s offerings) that she couldn’t beat it and to go with Nate.If you are looking for a mortgage or to refinance a current loan, look no further. You won’t regret it!!", "consumerName": "Cristina", "consumerFrom": "Tualatin, OR", "consumerReviewDate": "August 2019", "stars": 5}, {"title": "Excellent compnay!", "text": "Grander Home Loans is an excellent company and Nate was a pleasure to work with. He got us the best rate we could find and provided us with multiple options for refinancing our home. He took the time to guide us through every step and always kept us updated on where we were at in the process. Grader Home Loans will be our first option for any future home loans.", "consumerName": "Adrian", "consumerFrom": "Salem, OR", "consumerReviewDate": "August 2019", "stars": 5}, {"title": "Great Experience", "text": "Nate was on top of our refi from start to finish and beyond. Great rate with no fees as advertised. We had a small issue during the process which Nate handled with no cost to us which was above and beyond what was expected. ", "consumerName": "Lowell", "consumerFrom": "Santa Barbara, CA", "consumerReviewDate": "August 2019", "stars": 5}, {"title": "Nate Wells", "text": "Nate Wells with Grander Home Loans was excellent.  He is very patient and is very knowledgeable  of the mortgage industry.  Every question I had, he would always get back to me asa**.He's  great at  listening to  the customer and gives you a truly honest answer.  I am very pleased and highly recommend Nate Wells to help finance your purchasing needs.  Thank you Nate for all your help!!!!!", "consumerName": "Joe", "consumerFrom": "Downey, CA", "consumerReviewDate": "August 2019", "stars": 5}, {"title": "Top notch broker", "text": "Nate was one of the best brokers that I’ve worked with. I had a challenging and unique financial situation, but he helped me to navigate and jump through the hoops properly to qualify. We successfully closed for great terms.", "consumerName": "Ki", "consumerFrom": "Cypress, CA", "consumerReviewDate": "July 2019", "stars": 5}, {"title": "Great experience ", "text": "I began my work with Nate after filling out a refinance questionnaire on Lending Tree. Shortly thereafter I received several emails and phone calls from various lenders. I spoke with several people at several different companies but none of them seemed to actually care or want to take the time to understand my desired goals. After speaking with Nate, I realized he did indeed care about actually helping. He didn’t just look at us as another paycheck, he seemed to genuinely care about helping. Throughout the entire process Nate was very responsive whether it be through email, phone calls or text. If he didn’t immediately know an answer he would find the answer expeditiously and provide me that answer. He always ensured we knew where we were in the process, what to expect and what was next. He did not make any promises he did not keep, and he fought for us to get the best deal we could. After it was all said and done he saved us over 1% on our interest and proved to be an outstanding person to work with. Thank you Nate. ", "consumerName": "John", "consumerFrom": "Ewa Beach, HI", "consumerReviewDate": "July 2019", "stars": 5}, {"title": "Exceptional experience", "text": "Nate with Grander Home Loans was so easy to work with.  This is the second time I have used Nate.  He is quick to respond to questions and needs and makes the process so simple.  I highly recommend Nate.", "consumerName": "Joanne", "consumerFrom": "Sandy, OR", "consumerReviewDate": "July 2019", "stars": 5}, {"title": "Smooth Process!", "text": "As a military family and using the VA home loan things can get a bit tricky! With that said Nate of Grander Home Loans helped us with every detail and finding us the best rate! Nate has worked with my entire family! He keeps you in the loop and emails/calls to keep you updated on all the details! We have done 2 refi's with Grander Home Loans! We ended up saving a good amount on our mortgage and a nice lower percentage! Without a doubt would recommend them to all of our friends! ", "consumerName": "Courtney", "consumerFrom": "Spring Valley, CA", "consumerReviewDate": "July 2019", "stars": 5}, {"title": "Best Experience", "text": "Nate with Grander Home Loans was very professional and very always available whenever you have any questions. Kept us updated from the start of our loan process till the end.", "consumerName": "Renato", "consumerFrom": "Panorama City, CA", "consumerReviewDate": "July 2019", "stars": 5}, {"title": "Great Experience!", "text": "Nate with Grander Loans was so helpful with my refinance.  He made the entire process easy and kept me updated constantly. ", "consumerName": "Theresa", "consumerFrom": "Elk Grove, CA", "consumerReviewDate": "July 2019", "stars": 5}, {"title": "Above and Beyond", "text": "Matt was awesome to work with.  We thought we had an easy loan but they're were a few bumps in the road and Matt kept working to get us matched with the right lender, still with no fees and a good rate. Matt was responsive and always answered my never ending questions quickly.  Matt was 100% involved from day one until the day we closed.  I would use Matt again and definitely recommend him.", "consumerName": "Deanna", "consumerFrom": "Santa Rosa, CA", "consumerReviewDate": "July 2019", "stars": 5}, {"title": "Great Experience", "text": "I worked with Dustin Beerman and he was great! Good rates, no BS and no pushiness, but he kept me on track to get the best rate and get everything in on time. Highly recommended!", "consumerName": "matt", "consumerFrom": "Portland, OR", "consumerReviewDate": "July 2019", "stars": 5}, {"title": "Fast turnaround", "text": "We just finalized our 15 year ReFinance and Grander Home Loans made it a quick and painless experience. Nate Wells was very patient and answered all our questions regarding the process. I definitely recommend Grander Home Loans.", "consumerName": "Robert", "consumerFrom": "Mililani, HI", "consumerReviewDate": "July 2019", "stars": 5}, {"title": "Perfect experience", "text": "I’ve done 6 of these and Nate and grander home loans was far and away the best experience I’ve ever had. Great communication, great rates. ", "consumerName": "Justin", "consumerFrom": "San Diego, CA", "consumerReviewDate": "June 2019", "stars": 5}, {"title": "Barry P", "text": "Barry PWe recently worked with Nate W and Grander Home Loans to refinance our townhome and they were extremely helpful and diligent in every way.  Even when we were faced with some challenging situations regarding our HOA.  Nate in particular was so patient and attentive to detail that it gave us a sense of peace throughout the process during a difficult and challenging time.  We firmly believe that we may not have been able to close our Loan if it had not been for his relentless attempts to get this loan put though... We finally got it done at a great rate and with excellent terms.  We could not be happier!  We can now relax knowing that we can count on a consistent mortgage payment and budget, and can stay in our home indefinitely. We will definitely be referring Friends and Family to Grander Home Loans and Nate in the future for their Home Loan needs as well...With Great Appreciation,BP", "consumerName": "Barry", "consumerFrom": "Honolulu, HI", "consumerReviewDate": "May 2019", "stars": 5}, {"title": "Dustin Beerman", "text": "Dustin has done many loans and refinances for my family - some of them very difficult. He has always come thru for us despite having to deal with annoying details .Highly recommend .  ", "consumerName": "Rosina", "consumerFrom": "Los Angeles, CA", "consumerReviewDate": "May 2019", "stars": 5}, {"title": "\"...extraordinary help...\"", "text": "We completed our 30-year fixed duplex refinancing with the extraordinary help of Grander Home Loans and Nate Wells. The process was clearly communicated and executed flawlessly. The rates we achieved saved  money on our prior mortgage payments (lower interest rate) and put nearly $100,000 back into our pockets for further property improvements. We can categorically say Nate and Grander Home Loans should be your \"go-to\" resource for any mortgage financing. And we are proud to recommend them to our friends and family.", "consumerName": "Casey", "consumerFrom": "Encinitas, CA", "consumerReviewDate": "May 2019", "stars": 5}, {"title": "Awesome Refi Experience!", "text": "Nate with Grander Home Loans was great to work with! They took excellent care of my wife and I to complete a refinance that saved us over $200/month in our mortgage, and an entire % point in interest rate. The process couldn't have been easier, and would absolutely work with them again. ", "consumerName": "Dustin", "consumerFrom": "Denver, CO", "consumerReviewDate": "April 2019", "stars": 5}, {"title": "Great service ", "text": "I didn’t end up using him but I regret it. Very nice, quick service etc... I big name mortgage company promised me a 10 day close... that didn’t happen and as soon as the big name had my scythe service stopped. Wish I’d have used this company to finish my loan. ", "consumerName": "Farah", "consumerFrom": "Hillsboro, OR", "consumerReviewDate": "April 2019", "stars": 5}, {"title": "Easy, straight forward loan process", "text": "Grander was easy to work with. I refinanced my rental property from an interest only arm and HELOC to a fixed rate loan. My financial situation is not the most straight forward. Grander found a loan that worked for me and was able to close within 30 days. Communication was quick and accurate, the process was fairly painless without a bunch of back and forth with the underwriting which I had with other loans. I was able to sign as a convenient time and location. I would highly recommend.", "consumerName": "Brian", "consumerFrom": "Portland, OR", "consumerReviewDate": "April 2019", "stars": 5}, {"title": "Integrity and no hidden fees", "text": "We have used Nate Wells over at Grander Home Loans multiple times now. We have shopped around each time but always found with Nate, the lowest rates. We have thought it responsible to make sure that there were not lower rates and fees elsewhere. But the fact is, no one can beat Grander Loans and Nate’s honesty.  Our loans have been structured for no fees and we have never been let down.  Thank you once again for making the process quick and easy!  ", "consumerName": "Col", "consumerFrom": "Dallas, OR", "consumerReviewDate": "April 2019", "stars": 5}, {"title": "Excellent Service", "text": "This is my second time working with Grander Home Loans, but my first time working with Nate.  He contacted me because interest rates dropped and he wanted to see if we were interested in a refi.  Like my first experience with Grander Home, Nate was courteous, professional and patient. He explained in detail what I could expect. I never once felt pressure or doubted he was looking out for me.  He was a man of his word and kept me informed of the process.  Without hesitation I would recommend Nate Wells and Grander Home Loans for your home loan needs. ", "consumerName": "Nathan", "consumerFrom": "Stockton, CA", "consumerReviewDate": "April 2019", "stars": 5}, {"title": "A REAL PROFESSIONAL!  NATE, thank you so much for all your help!!!!  ", "text": "Nate at Grander Home Loans really helped our family in 2018 refinance our family home when our elderly mother suffered a heart attack, while fighting kidney cancer, and on Dialysis.  Nate was the help we needed, he guided us through the process back then.  Forward to February 2019, out of the blue, Nate calls us asking if we wanted to take advantage of lower interest rates. Of course, we listened to Nate's advice.  My dad and I saved about $30,000 over the life of the loan, shaved 1 year from a 30 year fixed to a 29year fixed, and Nate found enough credits where we PAID NO FEES! (Say what?!?)  NO FEES PAID! Nate said it, we agreed, and we trusted him. TWICE now he's done great things for us.  Hopefully he can help you too, God Bless.", "consumerName": "Albert", "consumerFrom": "Waipahu, HI", "consumerReviewDate": "April 2019", "stars": 5}, {"title": "Professional service", "text": "Nate was very knowledgeable, professional, couteous, upfront about all his fees, and very honest.  He communicated with us every step of the way.  I will never go with another lender as long as Nate is in business.", "consumerName": "Fernando", "consumerFrom": "San Diego, CA", "consumerReviewDate": "April 2019", "stars": 5}, {"title": "Great experience and service! ", "text": "I live in Hawaii, holding down a mortgage for about 12 years, this was my first refi, and so I was nervous and intimidated with the whole process. I wanted to get a 15 year fixed rate. And so I submitted an inquiry online which resulted in numerous calls from a lot of companies which felt somewhat pressuring as I wasn’t sure whom to go with. Nate Wells with Grander Home Loans reached out to me with a VM and a Text, texting/emailing was my preferred type of communication to get the ball rolling on the process.  Nate was very professional and I did not feel pressured or (very important) unsure of anything throughout the process. He always provided detailed explanations and walked me through the whole process step by step.  We were able to complete the whole process without issue and I am very happy with the service and results. This is how home buying/refi should be.  I’d recommend Nate Wells and the Grander Home Loans team for all your buying/refi needs! 5 out of 5 stars! Mahalo!  ", "consumerName": "Javin", "consumerFrom": "Kapaa, HI", "consumerReviewDate": "April 2019", "stars": 5}, {"title": "Great Service and Rates!", "text": "Grander coordinated our recent home refinance. Great service, no high pressure sales, and very professional in all ways. After reviewing the rates and closing costs of their competition hands down they are the best.", "consumerName": "Warner", "consumerFrom": "San Rafael, CA", "consumerReviewDate": "March 2019", "stars": 5}, {"title": "great experience", "text": "Dustin Beermann was professional and extremely helpful. He made the process simple and relatively painless. So glad we went with Grander Home Loans", "consumerName": "Cheryl", "consumerFrom": "Thousand Oaks, CA", "consumerReviewDate": "March 2019", "stars": 5}, {"title": "Excellent Service", "text": "Nate is very knowledgeable in this business, took my info and came back with the desired mortgage in a couple of days. You can rely on what Nate tells you.", "consumerName": "Robert", "consumerFrom": "Longmont, CO", "consumerReviewDate": "March 2019", "stars": 5}, {"title": "Great Experience!", "text": "Nate Wells was amazing to work with and I highly recommend him for your home loan and refinancing needs.. From beginning to end he was in constant contact with my husband, Scott and made our re-financing process so easy. If ever we need re-financing in the future we will contact Nate at Grander Home Loans.", "consumerName": "Lisa", "consumerFrom": "Arvada, CO", "consumerReviewDate": "March 2019", "stars": 5}, {"title": "Proved my banker wrong", "text": "Initially I was anxious to work with an on-line lender after I shared my efforts with my local banker (the holder of our past mortgage) but I was pleasantly surprised by the ease and particularly the cost of completing our refinance through Grander Home Loans. Nate Wells, of Grander, worked closely with us throughout the process and his reassurances were all kept. Although we had to perform a fair amount of leg work collecting documentation in the end it was well worth it. I would not hesitate to use Grander again.", "consumerName": "Samuel", "consumerFrom": "Lake Oswego, OR", "consumerReviewDate": "March 2019", "stars": 5}, {"title": "Best Experience ever!", "text": "Nate Wells at Grander Home Loans is the absolute best to work with.  I just finished my second Refi with Nate and it was the easiest, quickest process ever.  He is a complete professional and he follows through with what he tells you.  He is the only person I will go to when needing a home loan.", "consumerName": "Mark", "consumerFrom": "Yamhill, OR", "consumerReviewDate": "February 2019", "stars": 5}, {"title": "Grander is GREAT!", "text": "Nate at Grander provided us wonderful service on our mortgage.  He helped with an initial refi, attentive at every step of the way.  He followed through on all that he promised finding us the lowest rate and following through at every step of the way.  Then 6 months after our refi, as he said he would, he reached out again finding us a lower rate with no additional fees.  I recommend him without reservation.  ", "consumerName": "Paul", "consumerFrom": "Portland, OR", "consumerReviewDate": "February 2019", "stars": 5}, {"title": "Above and Beyond", "text": "Nate Wells was one of the most helpful people I've worked with during the entire home buying/refinancing process. He was always available to take my calls (even at odd hours), his email responses to my questions were thorough and accurate, and everything that was promised was delivered upon. This process could not have been easier as Nate owned being my point of contact from beginning to end. The reviews below speak for themselves. Above and Beyond is the theme from everyone and I feel the same way.\n\r\nNate and Grander Home Loans will be my first call when I do this again in the future!", "consumerName": "Jarren", "consumerFrom": "Aurora, CO", "consumerReviewDate": "February 2019", "stars": 5}, {"title": "Above and Beyond my expectations", "text": "Nate Wells was one of the most helpful people I've worked with during the entire home buying/refinancing process. He was always available to take my calls (even at odd hours), his email responses to my questions were thorough and accurate, and everything that was promised was delivered upon. This process could not have been easier as Nate owned being my point of contact from beginning to end. The reviews below speak for themselves. Above and Beyond is the theme from everyone and I feel the same way.\n\r\nNate and Grander Home Loans will be my first call when I do this again in the future!", "consumerName": "Jarren", "consumerFrom": "Aurora, CO", "consumerReviewDate": "February 2019", "stars": 5}, {"title": "It Worked! ", "text": "Thank you for putting me in touch with Grander Home Loans. I was skeptical but Nate Wells proved to overcome my objections from the very beginning. All said and done, it worked! We were able to get what we sought and am in a better position now. He has certainly over delivered with excellent customer service. I have already shared my experience with many! ", "consumerName": "Tammy Lynn", "consumerFrom": "Honolulu, HI", "consumerReviewDate": "February 2019", "stars": 5}, {"title": "Refinance ", "text": "Grander and Nate Wells specially made my refinace very seamless. Was very \r\nreceptive and followed through with everything that wasn’t promised. Would like to use him in the future ", "consumerName": "Brad", "consumerFrom": "Aurora, CO", "consumerReviewDate": "February 2019", "stars": 5}, {"title": "nate", "text": "Nate Wells at Grander Home Loans was amazing to work with.  My property (investment) and finances (retired) were more complicated than most and he took the time to truly understand everything and recommended the best way to move forward.  He explained every process and made everything very easy and simple to understand.  Never any pressure and always very responsive.  I will definitely call Nate the next time I need a mortgage!", "consumerName": "debbi", "consumerFrom": "Waterford, MI", "consumerReviewDate": "February 2019", "stars": 5}, {"title": "[email protected]", "text": "Nate Wells at Grander Home Loans was amazing to work with.  My property (investment) and finances (retired) were more complicated than most and he took the time to truly understand everything and recommended the best way to move forward.  He explained every process and made everything very easy and simple to understand.  Never any pressure and always very responsive.  I will definitely call Nate the next time I need a mortgage!", "consumerName": "debbi", "consumerFrom": "Waterford, MI", "consumerReviewDate": "February 2019", "stars": 5}, {"title": "Excellent refi experience!", "text": "I refinanced my home loan with Grander and couldn't be more pleased with my experience. There were no surprise costs or fees. All promises made up front were fulfilled. Jevon did an excellent job at guiding me through the process. He was very responsive, thorough and clear about the rate, fees and terms of the loan.  In addition, Jevon was able to provide me with unexpected credits during closing. Highly recommended!", "consumerName": "Susan", "consumerFrom": "San Anselmo, CA", "consumerReviewDate": "October 2017", "stars": 5}, {"title": "Great low rate", "text": "In our refinance with Grander, we received a rate a full percentage below what my current lender offered with no points.  The process happened in a timely manner and the responsiveness of our agent (Matt) was excellent.\r\nI was reluctant to respond to an advertisement in email but I am so glad I did. \r\nClosed a month ago, payoff of old loan seems to have gone through smoothly.  Saving big time monthly now, guess I'll buy that truck.", "consumerName": "stan", "consumerFrom": "Cottonwood, CA", "consumerReviewDate": "September 2017", "stars": 5}, {"title": "5 stars! - Refinance", "text": "Matt delivered on everything he said he would.  We got an amazing rate on a refi, and it happened quickly.  The only delay was waiting on an appraisal which was out of his hands.  Matt responded to calls and emails in a very timely manner.  He went over all costs in detail and was very professional.  I'm so glad we decided to go through him for our refinance.  ", "consumerName": "stan", "consumerFrom": "Cottonwood, CA", "consumerReviewDate": "September 2017", "stars": 5}, {"title": "Great service, no pressure, transparent", "text": "Grander was not the only company to respond to our Lending Tree query, and it certainly was not one to call most often.  When we dug into the numbers, however, it had the best deal by far both as to rates and costs.  We were then pleasantly surprised by the high degree of customer service provided by Nate Wells of Grander Home Loans.  He is very responsive and transparent, with no pressure.  Grander will not be the company to call you most often after a Lending Tree query, not even close.  Other bigger companies, with names you recognize, will hound you.  Do your homework on the numbers, and rest assured with the customer service, and transparency, of Grander.  One very happy customer here.    ", "consumerName": "Patrick", "consumerFrom": "Denver, CO", "consumerReviewDate": "September 2017", "stars": 5}, {"title": "Excellent refinance experience", "text": "We refinanced our primary home & Nate is awesome, he made the process painless & easy.  Since the refinance, Nate has gone above the call of duty & has kept us informed when rates have dropped again.", "consumerName": "Terri", "consumerFrom": "Kailua Kona, HI", "consumerReviewDate": "August 2017", "stars": 5}, {"title": "Would recommend too anyone", "text": "Jevon and his team were great. They helped us refinance our home. Very responsive and very low cost. Would use again and recommend to anyone.", "consumerName": "Andrew", "consumerFrom": "San Clemente, CA", "consumerReviewDate": "August 2017", "stars": 5}, {"title": "Nate is great!!", "text": "Nate Wells rocks! He helped me with two refinances over past two years and each time he provided exemplary customer service and always made me feel completely satisfied and at ease with everything. Great and answering questions and providing information. Honest, reliable, knows everything, I wish I had another property to refinance so that I could deal with Nate again!", "consumerName": "Jim", "consumerFrom": "Happy Valley, OR", "consumerReviewDate": "July 2017", "stars": 5}, {"title": "Best Refi experience ever!!!", "text": "Nate did an excellent job explaining all the documents leading up to closing.  He answered the phone nearly 100% of the times I called and returned calls promptly when he couldn't answer.  He went out of his way to make sure I got the best deal and did everything he could to save me money throughout the process.  Having financed 3 homes and refinanced 2 loans I can say with certainty that Grander Home Loans was the easiest I have ever worked with and by far the most reasonably priced!  HIRING GRANDER HOME LOANS IS A NO BRAINER!!!!!", "consumerName": "Mike", "consumerFrom": "Bend, OR", "consumerReviewDate": "July 2017", "stars": 5}, {"title": "Excellent Experience with Matt Gibbons", "text": "I had an excellent experience with Grander Home Loans, Inc. Matt Gibbons was the best loan officer I have ever worked with. He was very professional, precise and gave me the best deal. I highly recommend him. ", "consumerName": "Ben", "consumerFrom": "Garden Grove, CA", "consumerReviewDate": "July 2017", "stars": 5}, {"title": "Excellent Experience with Matt Gibbons ", "text": "I had an excellent experience with Grander Home Loans, Inc. Matt Gibbons was the best loan officer I have ever worked with. He was very professional, precise and gave me the best deal. I highly recommend him. He is really smart loan officer.", "consumerName": "Ben", "consumerFrom": "Garden Grove, CA", "consumerReviewDate": "July 2017", "stars": 5}, {"title": "Excellent costumer service ", "text": "The service that Matt provides is outstanding, he is honest, communicates right away and get you answers with in minutes. This being said makes me want to work with him again without a doubt.", "consumerName": "Dax", "consumerFrom": "San Lorenzo, CA", "consumerReviewDate": "June 2017", "stars": 5}, {"title": "The easiest home equity loan process ", "text": "I have done a home equity loan and refinance in the past and could be very stressful but working with Grander Home Loans for the first time was a whole different experience. My loan officer was  Matt Gibbons, he started my process and walked me through the end of it, Matt was able to answer my emails and phone calls right away or with in 5m and will not stop until any concerns or questions get resolved or answered. Now im doing a home refinance in a different property with Grander Home Loans again and is going great.", "consumerName": "Dax", "consumerFrom": "San Lorenzo, CA", "consumerReviewDate": "June 2017", "stars": 5}, {"title": "Matt Gibbons", "text": "Matt was very professional and extremely responsive. I would recommend him to any person looking to refinance. He kept us updated and helped us every step of the way. ", "consumerName": "juan", "consumerFrom": "San Jose, CA", "consumerReviewDate": "June 2017", "stars": 5}, {"title": "Matt Gibbons", "text": "Matt was very knowledgeable and helpful. He responded to our questions within the hour and always was happy to answer our questions. ", "consumerName": "juan", "consumerFrom": "San Jose, CA", "consumerReviewDate": "June 2017", "stars": 5}, {"title": "Nate is great!", "text": "Nate Wells was an absolute pleasure to work with. He was very responsive, an excellent communicator, very organized and treated me with honesty and integrity. He even offered me a better deal than he originally quoted. The process was very smooth and I felt very well taken care of by Nate. I wouldn't hesitate to work with him again.", "consumerName": "Danielle", "consumerFrom": "Portland, OR", "consumerReviewDate": "October 2018", "stars": 5}, {"title": "Grander Home Loans ", "text": "I would recommend Grander Home Loans.  They were efficient in the handling of our loan.  Great communication that got the job done. ", "consumerName": "Tracy", "consumerFrom": "Big Bear Lake, CA", "consumerReviewDate": "May 2017", "stars": 5}, {"title": "Grander Exceeded My Expectations", "text": "I reached out to Grander after seeing its great rates and great reviews, but I have to say after getting some bait-and-switch quotes from bigger lenders I didn't have high hopes. However, Nate and Grander Loans far exceeded my expectations. Right from the get-go Nate was honest and responsive, and not the least bit high pressure. He always responded immediately to my questions, was very clear about the process every step of the way, and even got me a better deal than he originally quoted. He treated me with honesty and integrity, and made my refi process stress-free. ", "consumerName": "Danielle", "consumerFrom": "Portland, OR", "consumerReviewDate": "October 2018", "stars": 5}, {"title": "Refi made easy", "text": "Very easy and smooth refi with Grander.  Thank you Matt for all your help!!", "consumerName": "ELLEN", "consumerFrom": "Torrance, CA", "consumerReviewDate": "April 2017", "stars": 5}, {"title": "Grander Knows What They're Doing", "text": "Nate and Mike were both extremely helpful, professional and courteous. Nate, the president of the company was able to handle my very complicated refinance in ways that others were not able or willing to help. He bent over backward to find the best rate with the lowest fees as well.\r\nDefinitely will use Grander again. ", "consumerName": "Kathy", "consumerFrom": "La Quinta, CA", "consumerReviewDate": "June 2018", "stars": 5}, {"title": "ReFi - made easy", "text": "I couldn't have asked for a more knowledgeable, attentive and responsive loan officer!  I will definitely be recommending him in the future - great experience!!", "consumerName": "ELLEN", "consumerFrom": "Torrance, CA", "consumerReviewDate": "April 2017", "stars": 5}, {"title": "Great experience ", "text": "We worked with Jevon to refi three properties and were impressed by his honesty and integrity. He delivers on his promises and is responsive and professional in his communication. We asked a lot of questions, and he always replied in a friendly professional manner. I have recommended Jevon to my close friends, neighbors, and family. More over, I have returned to Jevon for possible repeat business as I consider purchasing more real estate! ", "consumerName": "Jonathan", "consumerFrom": "Berkeley, CA", "consumerReviewDate": "April 2018", "stars": 5}, {"title": "Matt Gibbons - Simply the best!", "text": "There is one reason that I chose to work with Grander Home Loans - his name is Matt Gibbons.  I never felt pressured - as I have with other loan officers.  Matt instantly inspired confidence through his knowledge and professionalism.  Truly a positive experience from beginning to end -  which I have never been able to say about previous refi's!  Matt's follow through and overall responsiveness is unmatched.  Thank you Matt!  See you next time!", "consumerName": "Pamela", "consumerFrom": "Rancho Santa Margarita, CA", "consumerReviewDate": "April 2017", "stars": 5}, {"title": "Great experience", "text": "quicGrander Home Loans reached out to me and was very patient while I needed to wait for the final on our home. The loan officer followed up without being pushy. The final approval came in less than 24 hours after all my documents were submitted. ", "consumerName": "Karen", "consumerFrom": "Auburn, CA", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Best experience ever!", "text": "I have refinanced my home several times over the past 20 years.  My experience with Matt Gibbons and Grander Home Loans has been the best by far.  I especially appreciated the honesty and responsiveness of Matt Gibbons -  everything happened exactly as he told me it would  - and I have to say I was initially skeptical when he said that we could close in under a month - but we did!   I will definitely be calling Matt and Grander Home Loans for any future business.", "consumerName": "Pamela", "consumerFrom": "Rancho Santa Margarita, CA", "consumerReviewDate": "April 2017", "stars": 5}, {"title": "Quick and Easy", "text": "Matt was very knowledgeable and handled my loan efficiently and as stated. There were no fees, and he got it taken care of in 3 weeks. I would recommend Matt to all my friends.", "consumerName": "Karen", "consumerFrom": "Auburn, CA", "consumerReviewDate": "March 2018", "stars": 5}, {"title": "Jevon Hobbiebrunken rocks!!!", "text": "We purchased our house a couple years ago and unfortunately had to pay PMI or accept a higher interest rate.  We went with the higher interest rate. Fortunately our house went up in value and we contacted our original mortgage company for a refinance but were surprised at the costs for the loan. We then contacted Jevon Hobbiebrunken at Grander Home Loans. He was by far the most honest and efficient loan officer we have ever dealt with. He kept us informed throughout the process which went flawlessly. Everything he said he would do he did, and more.  Whatever you do, give him a call if you are looking for a home loan or refinance, you won't regret it.  Thanks agai Jevon.  ", "consumerName": "Brian", "consumerFrom": "Hesperia, CA", "consumerReviewDate": "January 2017", "stars": 5}, {"title": "Good rate, good service", "text": "I was very pleased by how fast and painless this process was.\r\nThe initial quote only took a few minutes, with no credit pull required, and low-pressure.\r\nThe rate and closing costs were tied for the lowest I had encountered in my search.\r\nI was able to get an appraisal waiver, saving even more time and money.\r\nNate provided me with frequent and easy to understand updates.\r\nThe final signing was easy to schedule - a mobile notary met me at my home.\r\nFrom start to finish the process took under a month.\n", "consumerName": "Kyle", "consumerFrom": "Portland, OR", "consumerReviewDate": "February 2018", "stars": 5}, {"title": "Great guy", "text": "Nate is very honest, professional, and checked in frequently to make sure everything was going smoothly.", "consumerName": "Mark", "consumerFrom": "Los Angeles, CA", "consumerReviewDate": "February 2018", "stars": 5}, {"title": "Professional and honest", "text": "Nate from Grander Home Loans is wonderful to work with.  He was patient, helpful, and at all times professional.  I was very satisfied with the mortgage I got.  About a half a year after the mortgage, Nate called me up out of the blue to let me know that interest rates had actually dropped.  He refinanced the mortgage for free so I could take advantage of the lower interest rate.", "consumerName": "Mark", "consumerFrom": "Los Angeles, CA", "consumerReviewDate": "February 2018", "stars": 5}, {"title": "Nate Wells is the best I've worked with", "text": "I recently completed my second refinance with Nate Wells.  He is an exemplary agent.  I am very pleased and happy with how both refis were completed with ZERO hassles.  I can't give Nate enough praise.  He is very professional and always keeps his word.  And the rates and fees can't be beat to top it off!", "consumerName": "elizabeth", "consumerFrom": "Roseburg, OR", "consumerReviewDate": "October 2017", "stars": 5}, {"title": "Thank you Jevon at Grander Home Loans", "text": "We purchased our house a couple years ago and unfortunately had to pay PMI or accept a higher interest rate.  We went with the higher interest rate. Fortunately our house went up in value and we contacted our original mortgage company for a refinance but were surprised at the costs for the loan. We then contacted Jevon Hobbiebrunken at Grander Home Loans. He was by far the most honest and efficient loan officer we have ever dealt with. He kept us informed throughout the process which went flawlessly. Everything he said he would do he did, and more.  Whatever you do, give him a call if you are looking for a home loan or refinance, you won't regret it.  Thanks agai Jevon.  ", "consumerName": "Brian", "consumerFrom": "Hesperia, CA", "consumerReviewDate": "January 2017", "stars": 5}, {"title": "Matt Gibbons is a \"Superstar\"", "text": "After talking with a number of the mortgage companies offered through Lending Tree, I chose Grander Home Loans because of the professionalism and customer service attitude of Matt Gibbons. The interest rates offered by most of the companies were similar, but it was Matt's calm approach and commitment to my needs that sealed the deal for me. Matt was expedient, very thorough, and made good on all of his commitments. I have closed at least 15 home loans in the past and this was by far one of, if not, the easiest and least stressful. I would highly recommend Grander Home Loans and Matt Gibbons.", "consumerName": "James", "consumerFrom": "Penngrove, CA", "consumerReviewDate": "January 2017", "stars": 5}, {"title": "The best around!", "text": "If there was a rating above five stars or better than excellent, I would, without a doubt, grant it. My wife and I have dealt with few companies and few agents in our life time; however, none is better or even comes close to Grander Home Loans and in particular Michael (Mike) Hansen.\r\nMichael and his team were simply amazing. Michael communicated clearly and professionally from the first call/email to the last even after closing and funding. What impressed most is that Michael even planned for “potential obstacles” or “what of” scenarios given how busy and the Oregon real-estate market is at this time. Michael understood and planned for delay on the appraisal process and negotiated a free extended period for locking the rate we have originally agreed upon. That is something he did not have to do but he did it anyway and thankfully he succeeded. Michael answered every question and provided every piece of information we have requested. Try him – you will be happy you did.\r\nWe understood the communication required to complete this refinance with the array of obstacles encountered and we commend Michael's efforts. We are also grateful for the lender's integrity for keeping the original loan terms and going far and beyond by extending the rate.  From our past experiences with lenders, this was truly a refreshing experience.  Thank you, Mike, for your wonderful communication and guidance.  It has been a pleasure.", "consumerName": "Wail", "consumerFrom": "Portland, OR", "consumerReviewDate": "December 2016", "stars": 5}, {"title": "Awesome Broker ", "text": "I choose Grander Home Loan based on the reviews I read on the company, but Matt's quick replies and follow up is what sold me on using the company, and I was not disappointed. Matt worked extra hard to make sure my non conventional loan closed with ease. He was very helpful with any questions I had and made sure I understood the whole process. I am very pleased with my loan and the experience working with Matt. I will without a doubt refer any friends and family to Matt and for any loan need I have in the future. Thank you Matt! ", "consumerName": "Josette", "consumerFrom": "Huntington Beach, CA", "consumerReviewDate": "July 2016", "stars": 5}, {"title": "Experience lives up to their name!", "text": "My wife and I have purchased or refinanced several homes and investment properties over the years.  Without exception, our experience with Grander Home Loans and Matt Gibbons in particular was faster, easier and more communicative.  Our loan was processed, underwritten and closed in three weeks.  Our rate was the most competitive available in the market.  We paid absolutely no closing costs or fees as promised.  Thank you Matt!  Your professionalism and attention to detail was much appreciated.  We will take every opportunity in the future to refer you business.", "consumerName": "Gary", "consumerFrom": "Del Mar, CA", "consumerReviewDate": "November 2016", "stars": 5}, {"title": "SMOOTH and FLAWLESS Experience. Highly Recommend.", "text": "I had a very smooth and flawless experience with my refi process with Grander. My loan agent Jevon Hobbiebrunken was very accessible and very prompt to respond to my queries  via emails or phone calls which I had a lot. He was very patient to answer them and explain all the details. I will not hesitate to reach out to him/Grander again for my financing needs.", "consumerName": "Ashish", "consumerFrom": "Santa Clara, CA", "consumerReviewDate": "July 2016", "stars": 5}, {"title": "A GREAT Experience ....", "text": "I highly recommend Grander Home Loans and Matt Gibbons. I've refinanced my home multiple times over the last 33 years but it has always been someone I am familiar with. I stepped out of my comfort zone earlier this year and tried The Lending Tree site.  After speaking with several lenders I choose Grander Home Loans. Matt took the time to address all of my questions and understood the goals I was trying to achieve with my refinance.  Shortly after our first phone call he followed up in writing addressing everything we discussed. I was quite impressed. I have just completed my 2nd refi with Matt this year and nothing has changed.  He's great!!! I referred a friend and Matt processed his loan as well.  THANK YOU Grander Home Loans and Matt Gibbons.", "consumerName": "Catherine", "consumerFrom": "San Pedro, CA", "consumerReviewDate": "October 2016", "stars": 5}, {"title": "Excellent Customer Service ", "text": "Matt was great to work with. I had many questions and concerns and Matt was able to answer and explain everything. He was very knowledgeable and patient. We had some unexpected obstacles and Matt was definitely a customer advocate and was able to provide beyond expected results. I was a bit leery doing everything from the phone and online but he was able to earn my trust and I feel comfortable with the entire process,  We did not have to leave our home to sign and Matt and his team handled EVERYTHING from start to finish.  We will definitely recommend him to friends and family. ", "consumerName": "Julie", "consumerFrom": "Brentwood, CA", "consumerReviewDate": "July 2016", "stars": 5}, {"title": "Excellent Service, Honest, Thorough", "text": "this is the ONLY lender recommended to me by Lending Tree that was upfront and honest, and they were exactly that every step of the way.  The communication with Jevon was incredible; he was very responsive, concerned, helpful, honest, and thorough.  I can't recommend Grander Loans and Jevon Hobbiebrunken enough - you won't be disappointed!", "consumerName": "Michele", "consumerFrom": "Portland, OR", "consumerReviewDate": "September 2016", "stars": 5}, {"title": "Thanks for the help, Mike!", "text": "Michael is friendly and responsive. He reached out and kept me in the loop throughout the entire process. He provided me updates whenever the process left his desk and responded even well after business hours (including weekends). He is very professional and provided detailed information through each step explaining each document. I received a great cash out and fantastic rates for both of my properties.", "consumerName": "Jay", "consumerFrom": "Mililani, HI", "consumerReviewDate": "June 2016", "stars": 5}, {"title": "Competitive, Professional and Timely", "text": "As with most lending processes, these days, the amount of documentation required for my refinance was extensive.  However, the process was incredibly quick and Mr. Gibbons was equally quick to respond to all requests and questions.  He kept things moving on or ahead of schedule, kept us informed every step of the way, and was professional and pleasant to work with.", "consumerName": "Krista", "consumerFrom": "West Hills, CA", "consumerReviewDate": "September 2016", "stars": 5}, {"title": "Top Notch Loan Officer", "text": "I have already recommended him directly to friends of mine. \n\r\n'nuff said. Jim", "consumerName": "Jim", "consumerFrom": "Waikoloa, HI", "consumerReviewDate": "June 2016", "stars": 5}, {"title": "Excellent Experience", "text": "My refinance loan closed today and I'm happy to report that the whole process went very smoothly.  The service I received from Matt at Grander was fantastic.  Although I sure he has a team of people working with him, I felt like he personally did everything associated with my loan.  He was always available by phone and email to answer my questions, and would contact me regularly with updates throughout the process.  \n\r\nI like that he was able to set me up with a leaner that covered the costs of the refinancing process, so it cost me nothing out of pocket.  He never tried to sell me 'points' or anything that would have made more money for him.  He was very knowledgeable and professional.  I am planning to work with him again if rates ever fall lower in the future.  ", "consumerName": "mike", "consumerFrom": "Upland, CA", "consumerReviewDate": "August 2016", "stars": 5}, {"title": "Smooth as Silk Professional Loan Processing", "text": "Easiest and most professionally executed refinance we have ever experienced! Matt delivered on all fronts, most importantly, the  lowest interest rate on a no-cost loan.  Matt and his team supplied all details of the loan in the first email and followed through on all points. They made the paper work effortless and worry free.\r\n Over the past twenty six years, we have refinanced several times following the purchase of two residences. We knew from those experiences that nothing goes as expected, and the loan process can be protracted, and sometimes painful. Not so with Matt! Our loan was truly cost free and the lowest rate available.   \r\nWe are very grateful to Matt, and will definitely call on him should we have need for loan services in the future.  ", "consumerName": "Diane", "consumerFrom": "Encinitas, CA", "consumerReviewDate": "May 2016", "stars": 5}, {"title": "Grander Home Loan Company Review", "text": "I would without a doubt refer any of my family or friends to Grander Home Loans. I choose Grander based off of the reviews I read about the company and the quick and consistent responses I received from Matt Gibbons at the company. My loan was unconventional and difficult but Matt was persistent did everything right to make it move smoothly. He answered all my questions and kept me informed throughout the process. I am confident he will take care of anyone I refer to him and make their experience as smooth and pleasant at mine was. ", "consumerName": "Josette", "consumerFrom": "Huntington Beach, CA", "consumerReviewDate": "August 2016", "stars": 5}, {"title": "Five stars!", "text": "My recent refi with Jevon at Grander Home Loans is a five stars! \r\nI had some complicated facets to the docs and went into bumps. However, Jevon helped me at every turn to make sure everything worked out.  He was very responsive to all calls and emails.  His prompt replies really helped reduce stress! \r\nHe is trustworthy; he kept his word for no cost to me, He also reimbursed my cost(US$307) I incurred at the US Consulate in Canada, including the overnight delivery Fedex fee.\r\nI would definitely recommend Jevon to others and plan to use him in the future.  He is the person you can rely on completely.\r\nThanks again Jevon!", "consumerName": "Miranda", "consumerFrom": "Los Angeles, CA", "consumerReviewDate": "May 2016", "stars": 5}, {"title": "Excellent Experience!!", "text": "What made my experience with Grander Home Loans an excellent one was having the opportunity to work with Matt Gibbons. Matt was a great example of what oustanding customer service should be.  He kept me well informed during the entire process and was extremely patient with my questions, concerns, and issues. He was prompt in answering calls and e-mails and always followed through with what was discussed and agreed on. Matt was always calm, pleasant, very professional, and most importantly, never pressured me into making a decision one way or another. It was quite difficult to select a trustworthy company to assist with my re-fi, but I was very fortunate to have worked with Matt Gibbons and Grander Home Loans.", "consumerName": "tracy", "consumerFrom": "Corona, CA", "consumerReviewDate": "August 2016", "stars": 5}, {"title": "Jevon is reponsive, trustworthy & patience!", "text": "My recent refi with Jevon at Grander Home Loans is a five stars! \r\nI had some complicated facets to the docs and went into bumps. However, Jevon helped me at every turn to make sure everything worked out.  He was very responsive to all calls and emails.  His prompt replies really helped reduce stress! \r\nHe is trustworthy; he kept his word for no cost to me, He also reimbursed my cost(US$307) I incurred at the US Consulate in Canada, including the overnight delivery Fedex fee.\r\nI would definitely recommend Jevon to others and plan to use him in the future.  He is the person you can rely on completely.\n", "consumerName": "Miranda", "consumerFrom": "Los Angeles, CA", "consumerReviewDate": "May 2016", "stars": 5}, {"title": "Mike Hanson - Grander Home Loans", "text": "Mike Hansen was a pleasure to work with - always professional, thorough and true to his word.  His responses were always timely and communications were clear.  I would highly recommend Mike to anyone interesting in refinancing or getting a new home loan.\n\r\nMike was a gem to work with overall. Smooth process - I give Mike very high marks!", "consumerName": "Linda", "consumerFrom": "Portland, OR", "consumerReviewDate": "May 2016", "stars": 5}, {"title": "MIKE HANSON AT GRANDER WAS AMAZING! ", "text": "From the very outset, Mike was quick, attentive, and assured me that he would be there to advocate for me.  He told me that he would keep an eye on the interest rates, and if after we did our lock down, the rate fell considerably, that he would start over again if I wanted to, and find me a better rate.  He held true to every single promise he made.  And, we actually closed at a lower rate, due to his vigilence, at the end.  After working with Greenlight, and with Wells Fargo, I was reticent to even start the process again, but have been left with such a good feeling that I have done nothing but tell everyone I know about Mike.  He is the consummate professional!", "consumerName": "Peggy", "consumerFrom": "Laguna Niguel, CA", "consumerReviewDate": "April 2016", "stars": 5}, {"title": "Great Customer Service", "text": "Matt was a pleasure to work with. Would be happy to recommend Grander especially if Matt is the loan officer.", "consumerName": "Mark", "consumerFrom": "Huntington Beach, CA", "consumerReviewDate": "April 2016", "stars": 5}, {"title": "Successful Refi with Grander", "text": "Grander offered the best rate and the lowest processing fees of any of the lenders I heard from through Lending Tree. Our contact at Grander, Matt Gibbons was easy to work with. He was responsive to our questions and fully explained each step of the way. It was a pleasure doing business with him.", "consumerName": "Mark", "consumerFrom": "Huntington Beach, CA", "consumerReviewDate": "April 2016", "stars": 5}, {"title": "Smooth refinance with Grander", "text": "This is my third refinance and my first with Grander. What a great experience for what can be a tedious process. My loan officer Mike Hansen is very friendly and provide personalized service. I never have to leave a voice message as he ALWAYS personally picks up the phone!\r\nHe responds promptly and professionally and up front about costs and what he can and can't do. During my refinance process he actually wound up getting me a lower rate then my original lock. \r\nIf you want excellent communication, honesty, integrity and a guy who knows how to get the loan done, call Mike and his team at Grander.\n", "consumerName": "Steven", "consumerFrom": "Irvine, CA", "consumerReviewDate": "April 2016", "stars": 5}, {"title": "Nate Wells ", "text": "Nate Wells was responsive, attentive and had a personal touch. We shopped around to find the best rates for our loan. Nate Wells went above and beyond to help us as well. He responded to e-mails and calls promptly and was a pleasure to work with Nate!", "consumerName": "Dave", "consumerFrom": "San Jose, CA", "consumerReviewDate": "March 2016", "stars": 5}, {"title": "Grander Home Loans, Nate Wells", "text": "Grander Home Loans, Inc was responsive, attentive and had a personal touch. We shopped around to find the best rates for our loan. Nate Wells went above and beyond to help us as well. He responded to e-mails and calls promptly and was a pleasure to work with. Thank You Nate!", "consumerName": "Dave", "consumerFrom": "San Jose, CA", "consumerReviewDate": "March 2016", "stars": 5}, {"title": "Refinance with Mike Hansen", "text": "Mike Hansen is very professional, easy to work with, carrying, smart and funny loan officer that we had pleasure to work with. Mike responded to all our emails and phone calls, followed up on a daily basis with the progress or any missed paperwork so we can close on time. He delivered everything he promised and I am glad we used his services for our refinance needs. I would recommend Mike to anyone who wants to buy or refinance without any problems, on time and with lowest rates in the market.\n", "consumerName": "Dina", "consumerFrom": "Escondido, CA", "consumerReviewDate": "March 2016", "stars": 5}, {"title": "Refinance with Grander Home Loans and Mike Hansen", "text": "The company is pretty new to the market but already does so well and has great reputation that we decided to do the business with them. We  completed refinance of our home in a little over a month. The whole process was super easy. We just had to provide lots of paperwork and they did the rest. We worked with Mike Hansen and were very satisfied with his services. He is very professional, carrying, smart and funny guy who responds to your every email and phone call, follows up on a daily basis with the progress of the loan and makes the whole experience worry-free and simple. Grander had the lowest rate compare to other loan companies and we are happy with the rate we got. We would recommend Grander Home Loans and Mike Hansen to anyone who is buying a home or looking to refinance.", "consumerName": "Dina", "consumerFrom": "Escondido, CA", "consumerReviewDate": "March 2016", "stars": 5}, {"title": "I felt Grander Loans worked on my side", "text": "Matt Gibbons did an amazing job on our refinancing. His patience, help, clarity and honesty were all very much appreciated by me and my wife. Throughout the process we felt that he was on our side working for us. He gave his estimated numbers without any hassle, gave us time to think and help us navigate the process. We wanted cash out of our refinancing and Matt helped us get to an optimum number. Our appraisal came higher than expected and he was prompt to give us additional credit for that. When we were late in some paperwork, he worked with us and extended the loan without any cost to us. I am a numbers person myself and I do my homework. I called many brokers before starting work on my refinancing and Matt was the only one who came across as being on our side. I will certainly go back to him next time I need any mortgage loan.", "consumerName": "Praveen", "consumerFrom": "Los Angeles, CA", "consumerReviewDate": "February 2016", "stars": 5}, {"title": "Great mortgage broker", "text": "He was really responsive and helpful in getting the refinance to our home.  He was always willing to answer questions or explain options to us. I'd highly recommend him to anyone.", "consumerName": "Jiro", "consumerFrom": "Portland, OR", "consumerReviewDate": "February 2016", "stars": 5}, {"title": "Great mortgage company", "text": "Nate at Grander was incredibly helpful in refinancing our house.  We got a great rate and he really worked hard getting the loan through (even when there were holdups from the current mortgage holder).  He has been really responsive and willing to answer any questions we had about the process or fees.  Even when we decided to change some details midstream (adding an escrow account) he was able to make it all happen.\n\r\nI really recommend Grander Home Loans to anyone out there looking to get a great low fee mortgage and will definitely be recommending them to all of my friends.", "consumerName": "Jiro", "consumerFrom": "Portland, OR", "consumerReviewDate": "February 2016", "stars": 5}, {"title": "Michael Hansen is a star", "text": "Great Service provided", "consumerName": "Kenb", "consumerFrom": "Rancho Mirage,", "consumerReviewDate": "August 2015", "stars": 5}, {"title": "Refinance", "text": "Prospect Financial was great. would recommend them for a home refinance.", "consumerName": "SylviaR", "consumerFrom": "Corona, CA", "consumerReviewDate": "July 2015", "stars": 5}, {"title": "Zeus", "text": "Highest praises for Michael. He was friendly and knowledgable. He got the job done! Would use him again in a heartbeat", "consumerName": "DBBRX", "consumerFrom": "Plymouth, ca", "consumerReviewDate": "July 2015", "stars": 5}, {"title": "Refi", "text": "kept us informed every step of the way and all the docs that were required. Even kept us up to date on the delays (due to IRS document delays).", "consumerName": "4580587", "consumerFrom": "Redondo Beach, CA", "consumerReviewDate": "May 2015", "stars": 5}, {"title": "Good service, product", "text": "zero cost produce delivered as advertised", "consumerName": "SMcEDHCA", "consumerFrom": "California,", "consumerReviewDate": "May 2015", "stars": 5}, {"title": "Recent client", "text": "Process was long and taxing but the outcome was worthwhile", "consumerName": "czechy8", "consumerFrom": "Ca,", "consumerReviewDate": "April 2015", "stars": 4}, {"title": "Peace of Mind Service", "text": "Nate Wells went above and beyond to ensure that I was comfortable through the refinance process. He always responded immediately to any questions I had and ensured that I was comfortable with each step in the process of going from a FHA Loan to a VA Loan. I'm grateful for his guidance and reassurance during a process that took some time because of the VA Loan Process. Very reliable and trustworthy. I'm grateful to have had him working on my loan.", "consumerName": "sfrndez", "consumerFrom": "Pomona, CA", "consumerReviewDate": "March 2015", "stars": 5}, {"title": "Matt Gibbons", "text": "Matt was very very professional and polite. He was easy to work with and delivered on everything we discussed. We mostly corresponded via email and he was always very prompt in responding. Receiving the edible arrangement at work was a nice gesture and a good laugh.", "consumerName": "Josh", "consumerFrom": "Stockton, Ca", "consumerReviewDate": "March 2015", "stars": 5}, {"title": "great experience", "text": "Michael Hansen provided outstanding support and service throughout the entire process. He was totally transparent and managed our expectation with truth and honesty. He was extremely responsive and kept in constant communication. I would highly recommend Michael Hansen!", "consumerName": "Anonymous", "consumerFrom": "Bay Area, CA", "consumerReviewDate": "March 2015", "stars": 5}, {"title": "Good job and Professional", "text": "Professional\nTimely\nHelpful\nResponsible\nFriendly\nAccurate\nOutstanding\nProfessional\nOutstanding", "consumerName": "JEBB", "consumerFrom": "Los Angeles, CA", "consumerReviewDate": "March 2015", "stars": 5}, {"title": "Awesome Customer Service", "text": "Matt was professional, helpful and always quick to respond to any question or concern.", "consumerName": "cbella73", "consumerFrom": "Riverside, CA", "consumerReviewDate": "February 2015", "stars": 5}, {"title": "Couldn't have asked for more", "text": "Michael was so friendly and walked us through every step of the process. He took time to explain the details and went above and beyond to make sure we got exactly what we wanted out of our refinance.", "consumerName": "Michelle", "consumerFrom": "Claremont, CA", "consumerReviewDate": "February 2015", "stars": 5}, {"title": "Jevon is the best", "text": "Jevon made it very easy to understand the process. He was very responsive to all of our calls and emails. We'd definitely recommend him to our friends.", "consumerName": "Franklin", "consumerFrom": "Napa,", "consumerReviewDate": "February 2015", "stars": 5}, {"title": "Jevon at Prospect Financial Group", "text": "Jevon was great to work with. He always clearly communicated with us and kept his word throughout he process. I highly recommend him!", "consumerName": "Justin", "consumerFrom": "San Luis Obispo, CA", "consumerReviewDate": "October 2014", "stars": 5}, {"title": "Pain Free Refinancing Experience", "text": "Jevon at Prospect was great to work with. He was professional, realistic in his predictions/promises, quick to respond to my emails, and able to clearly explain the process to me. We got a good rate and the loan closed quickly. We wouldn't hesitate to use him again in the future.", "consumerName": "donnamama", "consumerFrom": "Templeton, CA", "consumerReviewDate": "September 2014", "stars": 5}, {"title": "Great experience!", "text": "Jim is awesome to work with, he helps me a lot with my journey in refinancing. He is making sure that I understand everything and make me comfortable with these journey. Thanks again Jim!!! Great job!!!", "consumerName": "Manny", "consumerFrom": "Roseville, ca", "consumerReviewDate": "September 2014", "stars": 5}, {"title": "excellent customer service", "text": "I worked with Nathan and also Nicholas Cieri in my loan process. They were always great and responded immediately to all of my questions and concerns. Nicholas even stayed late when we were signing papers in case we had any problems or questions.", "consumerName": "t35031", "consumerFrom": "Yucaipa, CA", "consumerReviewDate": "September 2014", "stars": 5}, {"title": "Satisfied Customer", "text": "My re-fi was very easy. Jevon kept in touch often and communicated everything step by step. I was very pleased that everything he told me was true and correct. I also had his personal number and he answered my questions even on the weekend. I would use this company and Jevon again.", "consumerName": "Dlock", "consumerFrom": "Highland Ca,", "consumerReviewDate": "June 2014", "stars": 5}, {"title": "Jevon", "text": "Jevon was great to work with, he was timely and courteous. There were some snags with the final docs, but not sure if that was his fault or the loan company-He made sure it was good in the end and all worked out. He did an excellent job!", "consumerName": "BillyBo99", "consumerFrom": "California,", "consumerReviewDate": "June 2014", "stars": 4}, {"title": "Excellent Experience", "text": "Jevon made the refinance experience easy and refreshing. He made sure we had multiple options to choose from to make sure we were making the right choice for us. Thanks Jevon!", "consumerName": "Kerryk322", "consumerFrom": "Lakewood, CA", "consumerReviewDate": "May 2014", "stars": 5}, {"title": "Awesome Job!!", "text": "Thank you Jevon for all your hard work in keeping my file together and always answering my questions in a timely manner. Great job and keep in Touch!!\nRS", "consumerName": "RSMITH1710", "consumerFrom": "Northern California,", "consumerReviewDate": "May 2014", "stars": 5}]